dev/doc/book/dern-manual.org
#+TITLE: Octaspire Dern Manual
#+AUTHOR: www.octaspire.com
#+SETUPFILE: org-minimal-theme.setup
#+LANGUAGE: en
#+OPTIONS: toc:3

** About

Octaspire Dern[fn:1] is a platform independent programming language in
standard C99. It is a dialect of Lisp with influences from Scheme,
Emacs Lisp and C. It runs in Amiga, Plan9, Unix, Windows and almost
anything between.

Dern is dynamically typed language with *lexical scoping* and has *mark and sweep*
garbage collector. Functions in Dern are first class values. Unlike Lisp, that
uses linked lists as its major data structure, Dern uses vectors.

Dern is written in standard *C99* and depends only on a C compiler,
standard library and *octaspire-core* library. Dern should compile cleanly
without any warnings using =-Wall -Wextra= on any compiler supporting a subset
of C99. Currently it is tested with *gcc*, *clang*, *Tiny C Compiler (tcc)*,
*Portable C compiler (pcc)* and Plan9's *8c*.

Dern supports imperative and functional programming. It has atomic types
=integer=, =real=, (utf-8) =string=, (utf-8) =character=, (utf-8) =symbol=, =boolean=,
=nil=, (input/output) =port=, =hash-map=, =list=, =queue=, =environment=,
first class =Semantic Versioning number=,
first class =function=, =special= and =builtin=. As non-atomic type it has =vector=.
So, where in scheme ='(1 2 3)= is a list, in Dern it is a vector.

Every variable and function definition in Dern must be documented by a
*documentation string*. Dern also makes sure that every formal function
parameter is documented in the documentation of a function definition.
The documentation can be accessed with =doc=-function. =howto= is
another useful function. You can give it examples of function arguments
and expected result and it will tell you what functions you can call to
get the expected result from the given arguments.

Dern can also be extended with functions written in C; C-functions can be registered
as =builtin= or =special=. Arguments to builtins are evaluated normally, but to specials
are not, so specials can be used to implement special forms like =if=, etc. When
defining your own builtins and specials, you can tell Dern whether the function
can be tested by =howto= or not.

Dern has also a library system, that allows one to load libraries using builtin =require=.
On most systems Dern also supports loading of binary libraries (.so, .dll or .dylib  files).
For the end user, it doesn't matter whether the library she loaded was binary or written in
Dern; it can be used exactly the same way.

By using the amalgamated version of Dern, you need only one file. This same single source
file, *octaspire-dern-amalgamated.c*, can be compiled into (1) stand-alone unit test runner,
(2) interactive Dern-REPL and (3) used as a single header file library in programs that want
to embed the Dern-language. The file contains also the source for the Octaspire Core library.
The amalgamated source release is the recommended way of using Dern; there is only one file
to keep track of, it is easy to use with any build system, and the resulting machine code
even runs faster.

Dern is portable and is tested and known to run in Linux, FreeBSD, OpenBSD, NetBSD,
OpenIndiana, DragonFly BSD, MidnightBSD, MINIX 3, Haiku, Windows, ReactOS, macOS, Termux,
Plan9, AROS and Amiga.
The *how-to-build*-directory of the amalgamated source release contains a build script
for all tested platforms.

Please note, that this is the first language I have ever designed or implemented. There
are also a lot of features not yet implemented and probably bugs not yet fixed. The interpreter
is currently also just a tree walker, and not a faster bytecode vm.

Dern uses
[[http://semver.org][Semantic Versioning 2.0.0]] version numbering scheme.
As long as the MAJOR version number is zero anything can change at any time,
even in backwards incompatible manner.

** Building the amalgamated source release

The amalgamated source release is the recommended way of using Dern, if you don't need to
modify Dern itself. To use the amalgamated release, you will need only a C compiler and
C standard library supporting a subset of C99.

*** Linux, FreeBSD, OpenBSD, NetBSD, OpenIndiana, DragonFly BSD, MidnightBSD, MINIX 3, Haiku, macOS, Termux, AROS

#+BEGIN_SRC sh
curl -O octaspire.com/dern.tar.bz2
curl -O https://octaspire.io/dern.tar.bz2.sha512
sha512sum -c dern.tar.bz2.sha512
tar jxf dern.tar.bz2
cd dern
sh how-to-build/YOUR_PLATFORM_NAME_HERE.XX
#+END_SRC

replace *YOUR_PLATFORM_NAME_HERE.XX* with *FreeBSD.sh*, *NetBSD.sh*, *OpenBSD.sh*,
*OpenIndiana.sh*, *DragonFlyBSD.sh*, *MidnightBSD*, *linux.sh*, *minix3.sh*,
*haiku.sh*, *macOS.sh*, *termux.sh* or *AROS.sh*.
More scripts for different platforms will be added later.

*** Plan9

#+BEGIN_SRC sh
hget http://octaspire.com/dern.tar.bz2 > dern.tar.bz2
tar xf dern.tar.bz2
cd dern/*
rc how-to-build/Plan9.sh
#+END_SRC

*** Plan9 on ARM architecture

#+BEGIN_SRC sh
hget http://octaspire.com/dern.tar.bz2 > dern.tar.bz2
tar xf dern.tar.bz2
cd dern/*
rc how-to-build/Plan9-arm.sh
#+END_SRC

