release/documentation/dern-manual.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2018-06-29 Fri 10:00 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Octaspire Dern Manual</title>
<meta name="generator" content="Org mode" />
<meta name="author" content="www.octaspire.com" />
<link rel="stylesheet" type="text/css" href="https://octaspire.io/bundle-with-toc.min.css"/>
</head>
<body>
<div id="content">
<h1 class="title">Octaspire Dern Manual</h1>
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#org885403c">1. About</a></li>
<li><a href="#orgc8de449">2. Building the amalgamated source release</a>
<ul>
<li><a href="#org1480d41">2.1. Linux, FreeBSD, OpenBSD, NetBSD, OpenIndiana, DragonFly BSD, MidnightBSD, MINIX 3, Haiku, macOS, Termux, AROS</a></li>
<li><a href="#orge0f60b9">2.2. Plan9</a></li>
<li><a href="#orgbabcff7">2.3. Plan9 on ARM architecture</a></li>
<li><a href="#org4df787d">2.4. Windows using MinGW and Git</a></li>
<li><a href="#orgc92b99e">2.5. ReactOS</a></li>
<li><a href="#org80fa4e3">2.6. AmigaOS 4.x</a></li>
</ul>
</li>
<li><a href="#org7dc765d">3. Hello world</a></li>
<li><a href="#orgbdc6b28">4. Values</a></li>
<li><a href="#orgecefe15">5. Single and multiline comments, making script files executable</a></li>
<li><a href="#org9c241ce">6. Binding names to values with <code>define</code></a>
<ul>
<li><a href="#orge975951">6.1. Binding in other environments than the current one</a></li>
</ul>
</li>
<li><a href="#orgfa9c98d">7. Iteration</a></li>
<li><a href="#orga21a9d3">8. Comparing and changing values, predicates</a></li>
<li><a href="#orgc06e440">9. Removing the last value from a vector</a></li>
<li><a href="#orgaf624fc">10. Branching and selection</a></li>
<li><a href="#org78c66a5">11. Selecting values from collections</a></li>
<li><a href="#orgf768510">12. Accessing and manipulating command line arguments and environment variables</a></li>
<li><a href="#orgf84a2ac">13. Formatted and regular printing</a></li>
<li><a href="#org6042b7f">14. Formatted string creation</a></li>
<li><a href="#orgbb97136">15. Functions with variable number of arguments</a></li>
<li><a href="#org881198a">16. Environments</a></li>
<li><a href="#orgf6abdb6">17. Getting help with <code>howto</code></a></li>
<li><a href="#orgba5ca35">18. Returning from functions early</a></li>
<li><a href="#orgd6706ef">19. Evaluating values</a></li>
<li><a href="#org6b15543">20. Input and output ports</a></li>
<li><a href="#org0a8528a">21. Converting between types</a></li>
<li><a href="#org123d3e5">22. Searching and indexing</a></li>
<li><a href="#org804fbd1">23. Loading libraries with <code>require</code></a>
<ul>
<li><a href="#org5b9fa57">23.1. Building and using a binary library in Haiku</a></li>
<li><a href="#org738ab1b">23.2. Building and using a binary library in MINIX 3</a></li>
<li><a href="#org2932337">23.3. Building and using a binary library in Linux</a></li>
<li><a href="#org421fd11">23.4. Building and using a binary library in FreeBSD</a></li>
<li><a href="#orgf5a02e7">23.5. Building and using a binary library in NetBSD</a></li>
</ul>
</li>
<li><a href="#org9f944cf">24. Using custom library loader with <code>require</code></a></li>
<li><a href="#orgcab30a2">25. Embedding in C programs</a></li>
<li><a href="#orgb958fcd">26. Tool support</a></li>
<li><a href="#org09c6484">27. Using the development repository</a>
<ul>
<li><a href="#orgf2ebe6a">27.1. Raspberry Pi, Debian and Ubuntu</a></li>
<li><a href="#org8fb2827">27.2. Arch Linux</a></li>
<li><a href="#orgd6ce023">27.3. Haiku</a></li>
<li><a href="#orgdb2a47d">27.4. FreeBSD</a></li>
<li><a href="#orgefed063">27.5. NetBSD</a></li>
<li><a href="#org34a4bfa">27.6. MINIX 3</a></li>
</ul>
</li>
</ul>
</div>
</div>

<div id="outline-container-org885403c" class="outline-2">
<h2 id="org885403c"><span class="section-number-2">1</span> About</h2>
<div class="outline-text-2" id="text-1">
<p>
Octaspire Dern<sup><a id="fnr.1" class="footref" href="#fn.1">1</a></sup> is a platform independent programming language in
standard C99. It is a dialect of Lisp with influences from Scheme,
Emacs Lisp and C. It runs in Amiga, Plan9, Unix, Windows and almost
anything between.
</p>

<p>
Dern is dynamically typed language with <b>lexical scoping</b> and has <b>mark and sweep</b>
garbage collector. Functions in Dern are first class values. Unlike Lisp, that
uses linked lists as its major data structure, Dern uses vectors.
</p>

<p>
Dern is written in standard <b>C99</b> and depends only on a C compiler,
standard library and <b>octaspire-core</b> library. Dern should compile cleanly
without any warnings using <code>-Wall -Wextra</code> on any compiler supporting a subset
of C99. Currently it is tested with <b>gcc</b>, <b>clang</b>, <b>Tiny C Compiler (tcc)</b>,
<b>Portable C compiler (pcc)</b> and Plan9&rsquo;s <b>8c</b>.
</p>

<p>
Dern supports imperative and functional programming. It has atomic types
<code>integer</code>, <code>real</code>, (utf-8) <code>string</code>, (utf-8) <code>character</code>, (utf-8) <code>symbol</code>, <code>boolean</code>,
<code>nil</code>, (input/output) <code>port</code>, <code>hash-map</code>, <code>list</code>, <code>queue</code>, <code>environment</code>,
first class <code>function</code>, <code>special</code> and <code>builtin</code>. As non-atomic type it has <code>vector</code>.
So, where in scheme <code>'(1 2 3)</code> is a list, in Dern it is a vector.
</p>

<p>
Every variable and function definition in Dern must be documented by a
<b>documentation string</b>. Dern also makes sure that every formal function
parameter is documented in the documentation of a function definition.
The documentation can be accessed with <code>doc</code>-function. <code>howto</code> is
another useful function. You can give it examples of function arguments
and expected result and it will tell you what functions you can call to
get the expected result from the given arguments.
</p>

<p>
Dern can also be extended with functions written in C; C-functions can be registered
as <code>builtin</code> or <code>special</code>. Arguments to builtins are evaluated normally, but to specials
are not, so specials can be used to implement special forms like <code>if</code>, etc. When
defining your own builtins and specials, you can tell Dern whether the function
can be tested by <code>howto</code> or not.
</p>

<p>
Dern has also a library system, that allows one to load libraries using builtin <code>require</code>.
On most systems Dern also supports loading of binary libraries (.so, .dll or .dylib  files).
For the end user, it doesn&rsquo;t matter whether the library she loaded was binary or written in
Dern; it can be used exactly the same way.
</p>

<p>
By using the amalgamated version of Dern, you need only one file. This same single source
file, <b>octaspire-dern-amalgamated.c</b>, can be compiled into (1) stand-alone unit test runner,
(2) interactive Dern-REPL and (3) used as a single header file library in programs that want
to embed the Dern-language. The file contains also the source for the Octaspire Core library.
The amalgamated source release is the recommended way of using Dern; there is only one file
to keep track of, it is easy to use with any build system, and the resulting machine code
even runs faster.
</p>

<p>
Dern is portable and is tested and known to run in Linux, FreeBSD, OpenBSD, NetBSD,
OpenIndiana, DragonFly BSD, MidnightBSD, MINIX 3, Haiku, Windows, ReactOS, macOS, Termux,
Plan9, AROS and Amiga.
The <b>how-to-build</b>-directory of the amalgamated source release contains a build script
for all tested platforms.
</p>

<p>
Please note, that this is the first language I have ever designed or implemented. There
are also a lot of features not yet implemented and probably bugs not yet fixed. The interpreter
is currently also just a tree walker, and not a faster bytecode vm.
</p>

<p>
Dern uses
<a href="http://semver.org">Semantic Versioning 2.0.0</a> version numbering scheme.
As long as the MAJOR version number is zero anything can change at any time,
even in backwards incompatible manner.
</p>
</div>
</div>

<div id="outline-container-orgc8de449" class="outline-2">
<h2 id="orgc8de449"><span class="section-number-2">2</span> Building the amalgamated source release</h2>
<div class="outline-text-2" id="text-2">
<p>
The amalgamated source release is the recommended way of using Dern, if you don&rsquo;t need to
modify Dern itself. To use the amalgamated release, you will need only a C compiler and
C standard library supporting a subset of C99.
</p>
</div>

<div id="outline-container-org1480d41" class="outline-3">
<h3 id="org1480d41"><span class="section-number-3">2.1</span> Linux, FreeBSD, OpenBSD, NetBSD, OpenIndiana, DragonFly BSD, MidnightBSD, MINIX 3, Haiku, macOS, Termux, AROS</h3>
<div class="outline-text-3" id="text-2-1">
<div class="org-src-container">
<pre class="src src-sh">curl -O octaspire.com/dern.tar.bz2
curl -O https://octaspire.io/dern.tar.bz2.sha512
sha512sum -c dern.tar.bz2.sha512
tar jxf dern.tar.bz2
<span style="color: #DCDCCC; font-weight: bold;">cd</span> dern
sh how-to-build/YOUR_PLATFORM_NAME_HERE.XX
</pre>
</div>

<p>
replace <b>YOUR<sub>PLATFORM</sub><sub>NAME</sub><sub>HERE.XX</sub></b> with <b>FreeBSD.sh</b>, <b>NetBSD.sh</b>, <b>OpenBSD.sh</b>,
<b>OpenIndiana.sh</b>, <b>DragonFlyBSD.sh</b>, <b>MidnightBSD</b>, <b>linux.sh</b>, <b>minix3.sh</b>,
<b>haiku.sh</b>, <b>macOS.sh</b>, <b>termux.sh</b> or <b>AROS.sh</b>.
More scripts for different platforms will be added later.
</p>
</div>
</div>

<div id="outline-container-orge0f60b9" class="outline-3">
<h3 id="orge0f60b9"><span class="section-number-3">2.2</span> Plan9</h3>
<div class="outline-text-3" id="text-2-2">
<div class="org-src-container">
<pre class="src src-sh">hget http://octaspire.com/dern.tar.bz2 &gt; dern.tar.bz2
tar xf dern.tar.bz2
<span style="color: #DCDCCC; font-weight: bold;">cd</span> dern/*
rc how-to-build/Plan9.sh
</pre>
</div>
</div>
</div>

<div id="outline-container-orgbabcff7" class="outline-3">
<h3 id="orgbabcff7"><span class="section-number-3">2.3</span> Plan9 on ARM architecture</h3>
<div class="outline-text-3" id="text-2-3">
<div class="org-src-container">
<pre class="src src-sh">hget http://octaspire.com/dern.tar.bz2 &gt; dern.tar.bz2
tar xf dern.tar.bz2
<span style="color: #DCDCCC; font-weight: bold;">cd</span> dern/*
rc how-to-build/Plan9-arm.sh
</pre>
</div>
</div>
</div>
