dev/doc/book/dern-manual.org
*** Windows using MinGW and Git

Download and install *MinGW* from
[[http://www.mingw.org][www.mingw.org]] into a directory, for example into =C:\MinGW=.
Install *GCC* compiler.
Add =MinGW\bin= into the =PATH=
(for example, if you installed into =C:\MinGW=, add =C:\MinGW\bin= into the =PATH=).

Download and install [[https://git-scm.com/download/win][Git for Windows]].

Start *Git Bash* and run the following commands:

#+BEGIN_SRC sh
git clone https://github.com/octaspire/dern.git
cd dern/release
how-to-build/windows.sh
#+END_SRC

Start *Windows Command Prompt* and change directory to the same release directory, as
above. Run examples and programs in the *Command Prompt* window
(NOT in the Git Bash window).

*** ReactOS

Use *ReactOS Applications Manager* to install *CodeBlocks with GCC compiler* and
a *web browser* and *7-Zip*. Remember the path where you installed CodeBlocks.
Add *CodeBlocks\MinGW\bin* and *CodeBlocks\MinGW* into the *PATH*.
Use a web browser to download
[[https://octaspire.io/dern.tar.bz2][Dern release]].
Extract the file two times using 7-Zip, first into *dern.tar* and then into *dern*.
Go to the path where you extracted the archive and into the *version-x.y.z* directory.
Run command *how-to-build\ReactOS.bat*. If you need, you can download curses and SDL2
libraries and headers from
[[https://octaspire.io/dern-windeps.zip][here]].
Extract the archive and move the contents into the *version-x.y.z* directory.

*** AmigaOS 4.x

Download and install
[[http://www.hyperion-entertainment.biz/index.php/downloads?view=download&layout=form&file=82][AmigaOS SDK]].
Download and extract
[[http://aminet.net/util/arc/bzip2.lha][bzip2]] to get `bzip2_68k` executable.
Download the
[[http://octaspire.com/dern.tar.bz2][amalgamated Dern source release]].

Open Shell window and run the following commands:

#+BEGIN_SRC sh
bzip2_68k -dk dern.tar.bz2
tar xf dern.tar
cd dern
sh how-to-build/AmigaOS41.sh
#+END_SRC

