release/documentation/dern-manual.html

<div id="outline-container-org4df787d" class="outline-3">
<h3 id="org4df787d"><span class="section-number-3">2.4</span> Windows using MinGW and Git</h3>
<div class="outline-text-3" id="text-2-4">
<p>
Download and install <b>MinGW</b> from
<a href="http://www.mingw.org">www.mingw.org</a> into a directory, for example into <code>C:\MinGW</code>.
Install <b>GCC</b> compiler.
Add <code>MinGW\bin</code> into the <code>PATH</code>
(for example, if you installed into <code>C:\MinGW</code>, add <code>C:\MinGW\bin</code> into the <code>PATH</code>).
</p>

<p>
Download and install <a href="https://git-scm.com/download/win">Git for Windows</a>.
</p>

<p>
Start <b>Git Bash</b> and run the following commands:
</p>

<div class="org-src-container">
<pre class="src src-sh">git clone https://github.com/octaspire/dern.git
<span style="color: #DCDCCC; font-weight: bold;">cd</span> dern/release
how-to-build/windows.sh
</pre>
</div>

<p>
Start <b>Windows Command Prompt</b> and change directory to the same release directory, as
above. Run examples and programs in the <b>Command Prompt</b> window
(NOT in the Git Bash window).
</p>
</div>
</div>

<div id="outline-container-orgc92b99e" class="outline-3">
<h3 id="orgc92b99e"><span class="section-number-3">2.5</span> ReactOS</h3>
<div class="outline-text-3" id="text-2-5">
<p>
Use <b>ReactOS Applications Manager</b> to install <b>CodeBlocks with GCC compiler</b> and
a <b>web browser</b> and <b>7-Zip</b>. Remember the path where you installed CodeBlocks.
Add <b>CodeBlocks\MinGW\bin</b> and <b>CodeBlocks\MinGW</b> into the <b>PATH</b>.
Use a web browser to download
<a href="https://octaspire.io/dern.tar.bz2">Dern release</a>.
Extract the file two times using 7-Zip, first into <b>dern.tar</b> and then into <b>dern</b>.
Go to the path where you extracted the archive and into the <b>version-x.y.z</b> directory.
Run command <b>how-to-build\ReactOS.bat</b>. If you need, you can download curses and SDL2
libraries and headers from
<a href="https://octaspire.io/dern-windeps.zip">here</a>.
Extract the archive and move the contents into the <b>version-x.y.z</b> directory.
</p>
</div>
</div>

<div id="outline-container-org80fa4e3" class="outline-3">
<h3 id="org80fa4e3"><span class="section-number-3">2.6</span> AmigaOS 4.x</h3>
<div class="outline-text-3" id="text-2-6">
<p>
Download and install
<a href="http://www.hyperion-entertainment.biz/index.php/downloads?view=download&amp;layout=form&amp;file=82">AmigaOS SDK</a>.
Download and extract
<a href="http://aminet.net/util/arc/bzip2.lha">bzip2</a> to get `bzip2<sub>68k</sub>` executable.
Download the
<a href="http://octaspire.com/dern.tar.bz2">amalgamated Dern source release</a>.
</p>

<p>
Open Shell window and run the following commands:
</p>

<div class="org-src-container">
<pre class="src src-sh">bzip2_68k -dk dern.tar.bz2
tar xf dern.tar
<span style="color: #DCDCCC; font-weight: bold;">cd</span> dern
sh how-to-build/AmigaOS41.sh
</pre>
</div>
</div>
</div>
</div>
