release/documentation/dern-manual.html

<div id="outline-container-org7dc765d" class="outline-2">
<h2 id="org7dc765d"><span class="section-number-2">3</span> Hello world</h2>
<div class="outline-text-2" id="text-3">
<p>
Here we have a version of the classic &rsquo;Hello World&rsquo;-program in Octaspire Dern.
Instead of just printing &rsquo;Hello, World!&rsquo;, it is a bit more complex to give
you some feeling for the language. If you are in Unix-like system and
have <b>octaspire-dern-repl</b> in somewhere on your PATH, you can make the
script executable using the shebang. You can also run the file by
<code>octaspire-dern-repl hello-world.dern</code> or by writing it or parts
of it directly to the interactive REPL.
</p>

<div class="org-src-container">
<pre class="src src-octaspire-dern"><span style="color: #7F9F7F;">#!/usr/bin/env octaspire-dern-repl</span>
<span style="color: #7F9F7F;">This is a multiline comment.    !#</span>

<span style="color: #7F9F7F;">; 1. Print once 'Hello, World!' and newline</span>
<span style="color: #ff8c00;">(</span><span style="color: #DCDCCC; font-weight: bold;">println</span> <span style="color: #CC9393;">[Hello, World!]</span><span style="color: #ff8c00;">)</span>
<span style="color: #ff8c00;">(</span><span style="color: #DCDCCC; font-weight: bold;">println</span><span style="color: #ff8c00;">)</span>

<span style="color: #7F9F7F;">; 2. Print 11 times 'Hello x World!', x is 0 .. 10</span>
<span style="color: #ff8c00;">(</span><span style="color: #DCDCCC; font-weight: bold;">for</span> i from <span style="color: #ff1493;">{</span>D+0<span style="color: #ff1493;">}</span> to <span style="color: #ff1493;">{</span>D+10<span style="color: #ff1493;">}</span>
  <span style="color: #ff1493;">(</span><span style="color: #DCDCCC; font-weight: bold;">println</span> <span style="color: #CC9393;">[Hello {} World!]</span> i<span style="color: #ff1493;">)</span><span style="color: #ff8c00;">)</span>
<span style="color: #ff8c00;">(</span><span style="color: #DCDCCC; font-weight: bold;">println</span><span style="color: #ff8c00;">)</span>

<span style="color: #7F9F7F;">; 3. Print greetings to everybody on the vector</span>
<span style="color: #ff8c00;">(</span><span style="color: #DCDCCC; font-weight: bold;">define</span> names <span style="color: #DCDCCC; font-weight: bold;">as</span> '<span style="color: #ff1493;">(</span>John Alice Mark<span style="color: #ff1493;">)</span> <span style="color: #CC9393;">[Greetings list]</span><span style="color: #ff8c00;">)</span>
<span style="color: #ff8c00;">(</span><span style="color: #DCDCCC; font-weight: bold;">for</span> i <span style="color: #DCDCCC; font-weight: bold;">in</span> names <span style="color: #ff1493;">(</span><span style="color: #DCDCCC; font-weight: bold;">println</span> <span style="color: #CC9393;">[Happy holidays, {}!]</span> i<span style="color: #ff1493;">)</span><span style="color: #ff8c00;">)</span>
<span style="color: #ff8c00;">(</span><span style="color: #DCDCCC; font-weight: bold;">println</span><span style="color: #ff8c00;">)</span>

<span style="color: #7F9F7F;">; 4. Add new name, 'Lola', to the names to be greeted</span>
<span style="color: #ff8c00;">(</span><span style="color: #DCDCCC; font-weight: bold;">+=</span> names 'Lola<span style="color: #ff8c00;">)</span>
<span style="color: #ff8c00;">(</span><span style="color: #DCDCCC; font-weight: bold;">for</span> i <span style="color: #DCDCCC; font-weight: bold;">in</span> names <span style="color: #ff1493;">(</span><span style="color: #DCDCCC; font-weight: bold;">println</span> <span style="color: #CC9393;">[Happy holidays, {}!]</span> i<span style="color: #ff1493;">)</span><span style="color: #ff8c00;">)</span>
<span style="color: #ff8c00;">(</span><span style="color: #DCDCCC; font-weight: bold;">println</span><span style="color: #ff8c00;">)</span>

<span style="color: #7F9F7F;">; 5. Remove one name, 'Mark'</span>
<span style="color: #ff8c00;">(</span><span style="color: #DCDCCC; font-weight: bold;">-=</span> names 'Mark<span style="color: #ff8c00;">)</span>
<span style="color: #ff8c00;">(</span><span style="color: #DCDCCC; font-weight: bold;">for</span> i <span style="color: #DCDCCC; font-weight: bold;">in</span> names <span style="color: #ff1493;">(</span><span style="color: #DCDCCC; font-weight: bold;">println</span> <span style="color: #CC9393;">[Happy holidays, {}!]</span> i<span style="color: #ff1493;">)</span><span style="color: #ff8c00;">)</span>
<span style="color: #ff8c00;">(</span><span style="color: #DCDCCC; font-weight: bold;">println</span><span style="color: #ff8c00;">)</span>

<span style="color: #7F9F7F;">; 6. Define new function to greet people and use it</span>
<span style="color: #ff8c00;">(</span><span style="color: #DCDCCC; font-weight: bold;">define</span> greeter <span style="color: #DCDCCC; font-weight: bold;">as</span> <span style="color: #ff1493;">(</span><span style="color: #DCDCCC; font-weight: bold;">fn</span> <span style="color: #7fff00;">(</span>greeting name<span style="color: #7fff00;">)</span>
    <span style="color: #7fff00;">(</span><span style="color: #DCDCCC; font-weight: bold;">println</span> <span style="color: #CC9393;">[{}, {}!]</span> greeting name<span style="color: #7fff00;">)</span><span style="color: #ff1493;">)</span>
  <span style="color: #CC9393;">[My greeter function]</span> '<span style="color: #ff1493;">(</span>greeting <span style="color: #CC9393;">[the greeting]</span>
                          name <span style="color: #CC9393;">[who to greet]</span><span style="color: #ff1493;">)</span>
                          <span style="color: #DCDCCC; font-weight: bold;">howto-no</span><span style="color: #ff8c00;">)</span>

<span style="color: #ff8c00;">(</span>greeter 'Hi 'Alice<span style="color: #ff8c00;">)</span>

<span style="color: #7F9F7F;">; 7. Redefine greeter-function with early exit</span>
<span style="color: #7F9F7F;">; using 'return'</span>
<span style="color: #ff8c00;">(</span><span style="color: #DCDCCC; font-weight: bold;">define</span> grumpy <span style="color: #DCDCCC; font-weight: bold;">as</span> <span style="color: #BFEBBF;">true</span> <span style="color: #CC9393;">[is our hero grumpy, or not]</span><span style="color: #ff8c00;">)</span>

<span style="color: #ff8c00;">(</span><span style="color: #DCDCCC; font-weight: bold;">define</span> greeter <span style="color: #DCDCCC; font-weight: bold;">as</span> <span style="color: #ff1493;">(</span><span style="color: #DCDCCC; font-weight: bold;">fn</span> <span style="color: #7fff00;">(</span>greeting name<span style="color: #7fff00;">)</span>
    <span style="color: #7fff00;">(</span><span style="color: #DCDCCC; font-weight: bold;">if</span> grumpy <span style="color: #00bfff;">(</span><span style="color: #DCDCCC; font-weight: bold;">return</span> <span style="color: #CC9393;">[I'm grumpy and don't greet]</span><span style="color: #00bfff;">)</span><span style="color: #7fff00;">)</span>
    <span style="color: #7fff00;">(</span><span style="color: #DCDCCC; font-weight: bold;">println</span> <span style="color: #CC9393;">[{}, {}!]</span> greeting name<span style="color: #7fff00;">)</span>
    <span style="color: #7fff00;">(</span><span style="color: #DCDCCC; font-weight: bold;">string-format</span> <span style="color: #CC9393;">[I greeted "{}", as asked]</span> name<span style="color: #7fff00;">)</span><span style="color: #ff1493;">)</span>
  <span style="color: #CC9393;">[My greeter function]</span> '<span style="color: #ff1493;">(</span>greeting <span style="color: #CC9393;">[the greeting]</span>
                          name <span style="color: #CC9393;">[who to greet]</span><span style="color: #ff1493;">)</span>
                          <span style="color: #DCDCCC; font-weight: bold;">howto-no</span><span style="color: #ff8c00;">)</span>

<span style="color: #ff8c00;">(</span><span style="color: #DCDCCC; font-weight: bold;">println</span> <span style="color: #ff1493;">(</span>greeter 'Hi 'Alice<span style="color: #ff1493;">)</span><span style="color: #ff8c00;">)</span>
<span style="color: #ff8c00;">(</span><span style="color: #DCDCCC; font-weight: bold;">=</span> grumpy <span style="color: #BFEBBF;">false</span><span style="color: #ff8c00;">)</span>
<span style="color: #ff8c00;">(</span><span style="color: #DCDCCC; font-weight: bold;">println</span> <span style="color: #ff1493;">(</span>greeter 'Hi 'Alice<span style="color: #ff1493;">)</span><span style="color: #ff8c00;">)</span>
<span style="color: #ff8c00;">(</span><span style="color: #DCDCCC; font-weight: bold;">println</span><span style="color: #ff8c00;">)</span>

<span style="color: #7F9F7F;">; 8. Add names and custom greetings into a hash map</span>
<span style="color: #7F9F7F;">; and use it to greet people</span>
<span style="color: #ff8c00;">(</span><span style="color: #DCDCCC; font-weight: bold;">define</span> names <span style="color: #DCDCCC; font-weight: bold;">as</span> <span style="color: #ff1493;">(</span><span style="color: #DCDCCC; font-weight: bold;">hash-map</span> 'John 'Hi
                           'Lola 'Hello
                           'Mike 'Bonjour<span style="color: #ff1493;">)</span>
                        <span style="color: #CC9393;">[My custom greetings]</span><span style="color: #ff8c00;">)</span>

<span style="color: #ff8c00;">(</span><span style="color: #DCDCCC; font-weight: bold;">for</span> i <span style="color: #DCDCCC; font-weight: bold;">in</span> names <span style="color: #ff1493;">(</span>greeter <span style="color: #7fff00;">(</span>ln@ i <span style="color: #00bfff;">{</span>D+1<span style="color: #00bfff;">}</span><span style="color: #7fff00;">)</span> <span style="color: #7fff00;">(</span>ln@ i <span style="color: #00bfff;">{</span>D+0<span style="color: #00bfff;">}</span><span style="color: #7fff00;">)</span><span style="color: #ff1493;">)</span><span style="color: #ff8c00;">)</span>
</pre>
</div>
</div>
</div>
