dev/doc/book/dern-manual.org
** Values

#+BEGIN_SRC octaspire-dern
{D+128}              ; These are integers
{D-100}

{B+1001}             ;   9 in binary
{B-10011}            ; -19 in binary

{O+764}              ;  500 in octal
{O-764}              ; -500 in octal

{X+4B5}              ; 1205 in hexadecimal
{X-FF}               ; -255 in hexadecimal

{D+100 000 000}      ; Spaces can be used

{D+3.14}             ; These are real
{D-1.12}

0.1.2-rc.1+amd64     ; Semantic version numbers
1.0.1
2.1.0-4344b11
0.0.1+i386

[Hello]           ; These are strings (utf-8)
[Hell|6F|]        ; Hello
[Hello|newline|]  ; Hello and newline
[私はガラスを食べられます。それは私を傷つけません。]
|a|               ; These are characters (utf-8)
|newline|         ; \n
|tab|             ; \t
|bar|             ; |
|string-start|    ; [
|string-end|      ; ]
|61|              ; a in hexadecimal notation
|7A|              ; z in hexadecimal notation
|30DC|            ; ボ in hexadecimal notation
true              ; These are booleans
false
nil               ; Nil
'({D+1} {D+2} |a| [cat])      ; These are vectors
'()
(hash-map 'John [likes cats]  ; This is hash map
          'Lisa [likes dogs]
          'Mike '([likes numbers] {D+1} {D+2}
                                  {D+3} {D+4})
           {D+1}    |a|
           [Hi] {D+2})
#+END_SRC

The text after character =;= is a *single line comment*. Single line comments run until the end
of the line. Dern has also *multiline comments* that are written between =#!= and =!#=.
Note that string delimiters in Dern are =[= and =]= and not ="=;
this way dern code can be written inside C-programs without escaping.

Strings can be embedded in strings like this:

#+BEGIN_SRC octaspire-dern
[string |string-start|with another inside|string-end|]
#+END_SRC

This can be useful sometimes, for example, if you need to evaluate a string as
a program and need it to have strings inside.

** Single and multiline comments, making script files executable

Below are examples of single and multiline comments:

#+BEGIN_SRC octaspire-dern
; This is single line comment.

#! This is multiline comment.
   It can contain multiple lines...
   ... !#
#+END_SRC

Multiline comments can be used to make script files executable in UNIX-like systems:

#+BEGIN_SRC octaspire-dern
#!/usr/bin/env octaspire-dern-repl
!#

(println [Hello World])
#+END_SRC

** Binding names to values with =define=

#+BEGIN_SRC octaspire-dern
(define pi as {D+3.14} [value for pi])
(define names as '(John Lisa Mark) [names list])
(define double as (fn (x) (* {D+2} x)) [doubles nums]
    '(x [this is doubled]) howto-ok)
#+END_SRC

Here we bind three values to a name: one real, one vector and one function taking one argument.
Here is an example of using those names:

#+BEGIN_SRC octaspire-dern
pi
names
(double {D+1})
#+END_SRC

And to see the documentation for these values:

#+BEGIN_SRC octaspire-dern
(doc pi)
(doc names)
(doc double)
#+END_SRC

The documentation of the function contains also documentation for the parameters.

Function =doc= can also be used with builtins and specials defined by the standard
library or user in C.

Please note that at the time of writing most of the functions
in Dern's standard library are not yet documented properly. This is a work in progress.

*** Binding in other environments than the current one

By using an explicit environment argument as the first argument to =define=, we can bind
names to values in other environments than the current one. Example:

#+BEGIN_SRC octaspire-dern
(define myEnv as (env-new) [my own environment])
(define pi as {D+3.14} [value for pi] in myEnv)

pi                  ; <error>: Unbound symbol 'pi'
(eval pi myEnv)     ; 3.14
#+END_SRC

In the example above, =pi= is undefined in the current (global) environment, but it
is defined in the =myEnv=-environment. We use special =eval= to evaluate =pi= in the
=myEnv=-environment.

