release/documentation/dern-manual.html

<div id="outline-container-orgbdc6b28" class="outline-2">
<h2 id="orgbdc6b28"><span class="section-number-2">4</span> Values</h2>
<div class="outline-text-2" id="text-4">
<div class="org-src-container">
<pre class="src src-octaspire-dern"><span style="color: #ff8c00;">{</span>D+128<span style="color: #ff8c00;">}</span>              <span style="color: #7F9F7F;">; These are integers</span>
<span style="color: #ff8c00;">{</span>D-100<span style="color: #ff8c00;">}</span>

<span style="color: #ff8c00;">{</span>B+1001<span style="color: #ff8c00;">}</span>             <span style="color: #7F9F7F;">;   9 in binary</span>
<span style="color: #ff8c00;">{</span>B-10011<span style="color: #ff8c00;">}</span>            <span style="color: #7F9F7F;">; -19 in binary</span>

<span style="color: #ff8c00;">{</span>O+764<span style="color: #ff8c00;">}</span>              <span style="color: #7F9F7F;">;  500 in octal</span>
<span style="color: #ff8c00;">{</span>O-764<span style="color: #ff8c00;">}</span>              <span style="color: #7F9F7F;">; -500 in octal</span>

<span style="color: #ff8c00;">{</span>X+4B5<span style="color: #ff8c00;">}</span>              <span style="color: #7F9F7F;">; 1205 in hexadecimal</span>
<span style="color: #ff8c00;">{</span>X-FF<span style="color: #ff8c00;">}</span>               <span style="color: #7F9F7F;">; -255 in hexadecimal</span>

<span style="color: #ff8c00;">{</span>D+100 000 000<span style="color: #ff8c00;">}</span>      <span style="color: #7F9F7F;">; Spaces can be used</span>

<span style="color: #ff8c00;">{</span>D+3.14<span style="color: #ff8c00;">}</span>             <span style="color: #7F9F7F;">; These are real</span>
<span style="color: #ff8c00;">{</span>D-1.12<span style="color: #ff8c00;">}</span>

<span style="color: #CC9393;">[Hello]</span>           <span style="color: #7F9F7F;">; These are strings (utf-8)</span>
<span style="color: #CC9393;">[Hell|6F|]</span>        <span style="color: #7F9F7F;">; Hello</span>
<span style="color: #CC9393;">[Hello|newline|]</span>  <span style="color: #7F9F7F;">; Hello and newline</span>
<span style="color: #CC9393;">[&#31169;&#12399;&#12460;&#12521;&#12473;&#12434;&#39135;&#12409;&#12425;&#12428;&#12414;&#12377;&#12290;&#12381;&#12428;&#12399;&#31169;&#12434;&#20663;&#12388;&#12369;&#12414;&#12379;&#12435;&#12290;]</span>
<span style="color: #CC9393;">|a|</span>               <span style="color: #7F9F7F;">; These are characters (utf-8)</span>
<span style="color: #CC9393;">|newline|</span>         <span style="color: #7F9F7F;">; \n</span>
<span style="color: #CC9393;">|tab|</span>             <span style="color: #7F9F7F;">; \t</span>
<span style="color: #CC9393;">|bar|</span>             <span style="color: #7F9F7F;">; |</span>
<span style="color: #CC9393;">|string-start|</span>    <span style="color: #7F9F7F;">; [</span>
<span style="color: #CC9393;">|string-end|</span>      <span style="color: #7F9F7F;">; ]</span>
<span style="color: #CC9393;">|61|</span>              <span style="color: #7F9F7F;">; a in hexadecimal notation</span>
<span style="color: #CC9393;">|7A|</span>              <span style="color: #7F9F7F;">; z in hexadecimal notation</span>
<span style="color: #CC9393;">|30DC|</span>            <span style="color: #7F9F7F;">; &#12508; in hexadecimal notation</span>
<span style="color: #BFEBBF;">true</span>              <span style="color: #7F9F7F;">; These are booleans</span>
<span style="color: #BFEBBF;">false</span>
<span style="color: #BFEBBF;">nil</span>               <span style="color: #7F9F7F;">; Nil</span>
'<span style="color: #ff8c00;">(</span><span style="color: #ff1493;">{</span>D+1<span style="color: #ff1493;">}</span> <span style="color: #ff1493;">{</span>D+2<span style="color: #ff1493;">}</span> <span style="color: #CC9393;">|a|</span> <span style="color: #CC9393;">[cat]</span><span style="color: #ff8c00;">)</span>      <span style="color: #7F9F7F;">; These are vectors</span>
'<span style="color: #ff8c00;">()</span>
<span style="color: #ff8c00;">(</span><span style="color: #DCDCCC; font-weight: bold;">hash-map</span> 'John <span style="color: #CC9393;">[likes cats]</span>  <span style="color: #7F9F7F;">; This is hash map</span>
          'Lisa <span style="color: #CC9393;">[likes dogs]</span>
          'Mike '<span style="color: #ff1493;">(</span><span style="color: #CC9393;">[likes numbers]</span> <span style="color: #7fff00;">{</span>D+1<span style="color: #7fff00;">}</span> <span style="color: #7fff00;">{</span>D+2<span style="color: #7fff00;">}</span>
                                  <span style="color: #7fff00;">{</span>D+3<span style="color: #7fff00;">}</span> <span style="color: #7fff00;">{</span>D+4<span style="color: #7fff00;">}</span><span style="color: #ff1493;">)</span>
           <span style="color: #ff1493;">{</span>D+1<span style="color: #ff1493;">}</span>    <span style="color: #CC9393;">|a|</span>
           <span style="color: #CC9393;">[Hi]</span> <span style="color: #ff1493;">{</span>D+2<span style="color: #ff1493;">}</span><span style="color: #ff8c00;">)</span>
</pre>
</div>

<p>
The text after character <code>;</code> is a <b>single line comment</b>. Single line comments run until the end
of the line. Dern has also <b>multiline comments</b> that are written between <code>#!</code> and <code>!#</code>.
Note that string delimiters in Dern are <code>[</code> and <code>]</code> and not <code>"</code>;
this way dern code can be written inside C-programs without escaping.
</p>

<p>
Strings can be embedded in strings like this:
</p>

<div class="org-src-container">
<pre class="src src-octaspire-dern"><span style="color: #CC9393;">[string |string-start|with another inside|string-end|]</span>
</pre>
</div>

<p>
This can be useful sometimes, for example, if you need to evaluate a string as
a program and need it to have strings inside.
</p>
</div>
</div>

<div id="outline-container-orgecefe15" class="outline-2">
<h2 id="orgecefe15"><span class="section-number-2">5</span> Single and multiline comments, making script files executable</h2>
<div class="outline-text-2" id="text-5">
<p>
Below are examples of single and multiline comments:
</p>

<div class="org-src-container">
<pre class="src src-octaspire-dern"><span style="color: #7F9F7F;">; This is single line comment.</span>

<span style="color: #7F9F7F;">#! This is multiline comment.</span>
<span style="color: #7F9F7F;">   It can contain multiple lines...</span>
<span style="color: #7F9F7F;">   ... !#</span>
</pre>
</div>

<p>
Multiline comments can be used to make script files executable in UNIX-like systems:
</p>

<div class="org-src-container">
<pre class="src src-octaspire-dern"><span style="color: #7F9F7F;">#!/usr/bin/env octaspire-dern-repl</span>
<span style="color: #7F9F7F;">!#</span>

<span style="color: #ff8c00;">(</span><span style="color: #DCDCCC; font-weight: bold;">println</span> <span style="color: #CC9393;">[Hello World]</span><span style="color: #ff8c00;">)</span>
</pre>
</div>
</div>
</div>

<div id="outline-container-org9c241ce" class="outline-2">
<h2 id="org9c241ce"><span class="section-number-2">6</span> Binding names to values with <code>define</code></h2>
<div class="outline-text-2" id="text-6">
<div class="org-src-container">
<pre class="src src-octaspire-dern"><span style="color: #ff8c00;">(</span><span style="color: #DCDCCC; font-weight: bold;">define</span> pi <span style="color: #DCDCCC; font-weight: bold;">as</span> <span style="color: #ff1493;">{</span>D+3.14<span style="color: #ff1493;">}</span> <span style="color: #CC9393;">[value for pi]</span><span style="color: #ff8c00;">)</span>
<span style="color: #ff8c00;">(</span><span style="color: #DCDCCC; font-weight: bold;">define</span> names <span style="color: #DCDCCC; font-weight: bold;">as</span> '<span style="color: #ff1493;">(</span>John Lisa Mark<span style="color: #ff1493;">)</span> <span style="color: #CC9393;">[names list]</span><span style="color: #ff8c00;">)</span>
<span style="color: #ff8c00;">(</span><span style="color: #DCDCCC; font-weight: bold;">define</span> double <span style="color: #DCDCCC; font-weight: bold;">as</span> <span style="color: #ff1493;">(</span><span style="color: #DCDCCC; font-weight: bold;">fn</span> <span style="color: #7fff00;">(</span>x<span style="color: #7fff00;">)</span> <span style="color: #7fff00;">(</span><span style="color: #DCDCCC; font-weight: bold;">*</span> <span style="color: #00bfff;">{</span>D+2<span style="color: #00bfff;">}</span> x<span style="color: #7fff00;">)</span><span style="color: #ff1493;">)</span> <span style="color: #CC9393;">[doubles nums]</span>
    '<span style="color: #ff1493;">(</span>x <span style="color: #CC9393;">[this is doubled]</span><span style="color: #ff1493;">)</span> <span style="color: #DCDCCC; font-weight: bold;">howto-ok</span><span style="color: #ff8c00;">)</span>
</pre>
</div>

<p>
Here we bind three values to a name: one real, one vector and one function taking one argument.
Here is an example of using those names:
</p>

<div class="org-src-container">
<pre class="src src-octaspire-dern">pi
names
<span style="color: #ff8c00;">(</span>double <span style="color: #ff1493;">{</span>D+1<span style="color: #ff1493;">}</span><span style="color: #ff8c00;">)</span>
</pre>
</div>

<p>
And to see the documentation for these values:
</p>

<div class="org-src-container">
<pre class="src src-octaspire-dern"><span style="color: #ff8c00;">(</span><span style="color: #DCDCCC; font-weight: bold;">doc</span> pi<span style="color: #ff8c00;">)</span>
<span style="color: #ff8c00;">(</span><span style="color: #DCDCCC; font-weight: bold;">doc</span> names<span style="color: #ff8c00;">)</span>
<span style="color: #ff8c00;">(</span><span style="color: #DCDCCC; font-weight: bold;">doc</span> double<span style="color: #ff8c00;">)</span>
</pre>
</div>

<p>
The documentation of the function contains also documentation for the parameters.
</p>

<p>
Function <code>doc</code> can also be used with builtins and specials defined by the standard
library or user in C.
</p>

<p>
Please note that at the time of writing most of the functions
in Dern&rsquo;s standard library are not yet documented properly. This is a work in progress.
</p>
</div>

<div id="outline-container-orge975951" class="outline-3">
<h3 id="orge975951"><span class="section-number-3">6.1</span> Binding in other environments than the current one</h3>
<div class="outline-text-3" id="text-6-1">
<p>
By using an explicit environment argument as the first argument to <code>define</code>, we can bind
names to values in other environments than the current one. Example:
</p>

<div class="org-src-container">
<pre class="src src-octaspire-dern"><span style="color: #ff8c00;">(</span><span style="color: #DCDCCC; font-weight: bold;">define</span> myEnv <span style="color: #DCDCCC; font-weight: bold;">as</span> <span style="color: #ff1493;">(</span><span style="color: #DCDCCC; font-weight: bold;">env-new</span><span style="color: #ff1493;">)</span> <span style="color: #CC9393;">[my own environment]</span><span style="color: #ff8c00;">)</span>
<span style="color: #ff8c00;">(</span><span style="color: #DCDCCC; font-weight: bold;">define</span> pi <span style="color: #DCDCCC; font-weight: bold;">as</span> <span style="color: #ff1493;">{</span>D+3.14<span style="color: #ff1493;">}</span> <span style="color: #CC9393;">[value for pi]</span> <span style="color: #DCDCCC; font-weight: bold;">in</span> myEnv<span style="color: #ff8c00;">)</span>

pi                  <span style="color: #7F9F7F;">; &lt;error&gt;: Unbound symbol 'pi'</span>
<span style="color: #ff8c00;">(</span><span style="color: #DCDCCC; font-weight: bold;">eval</span> pi myEnv<span style="color: #ff8c00;">)</span>     <span style="color: #7F9F7F;">; 3.14</span>
</pre>
</div>

<p>
In the example above, <code>pi</code> is undefined in the current (global) environment, but it
is defined in the <code>myEnv</code>-environment. We use special <code>eval</code> to evaluate <code>pi</code> in the
<code>myEnv</code>-environment.
</p>
</div>
</div>
</div>
