dev/doc/book/dern-manual.org
** Iteration

Dern has two looping constructs: =while= and =for=. For can be used numerically, with a
container (vector, string, hash-map, etc.) and with (input) *ports*.
Below is couple of examples:

#+BEGIN_SRC octaspire-dern
(define i as {D+0} [my counter])
(while (<= i {D+10}) (println [Going at {}] i) (++ i))
#+END_SRC

Numerical for:

#+BEGIN_SRC octaspire-dern
(for i from {D+0} to {D+10} (println [Hello {}!] i))
#+END_SRC

Container for:

#+BEGIN_SRC octaspire-dern
(define names as '(John Mark Lisa) [names list])
(for i in names (println [Hello {} World!] i))
#+END_SRC

Both the *numerical for* and *container for* support the use of optional =step= to change the
way the iterator is incremented:

#+BEGIN_SRC octaspire-dern
(for i from {D+0} to {D+10} step {D+3}
  (println [Hello {}!] i))

(define names as '(John Mark Lisa) [names list])
(for i in names step {D+2}
  (println [Hello {} World!] i))
#+END_SRC

