release/documentation/dern-manual.html

<div id="outline-container-orgfa9c98d" class="outline-2">
<h2 id="orgfa9c98d"><span class="section-number-2">7</span> Iteration</h2>
<div class="outline-text-2" id="text-7">
<p>
Dern has two looping constructs: <code>while</code> and <code>for</code>. For can be used numerically, with a
container (vector, string, hash-map, etc.) and with (input) <b>ports</b>.
Below is couple of examples:
</p>

<div class="org-src-container">
<pre class="src src-octaspire-dern"><span style="color: #ff8c00;">(</span><span style="color: #DCDCCC; font-weight: bold;">define</span> i <span style="color: #DCDCCC; font-weight: bold;">as</span> <span style="color: #ff1493;">{</span>D+0<span style="color: #ff1493;">}</span> <span style="color: #CC9393;">[my counter]</span><span style="color: #ff8c00;">)</span>
<span style="color: #ff8c00;">(</span><span style="color: #DCDCCC; font-weight: bold;">while</span> <span style="color: #ff1493;">(</span><span style="color: #DCDCCC; font-weight: bold;">&lt;=</span> i <span style="color: #7fff00;">{</span>D+10<span style="color: #7fff00;">}</span><span style="color: #ff1493;">)</span> <span style="color: #ff1493;">(</span><span style="color: #DCDCCC; font-weight: bold;">println</span> <span style="color: #CC9393;">[Going at {}]</span> i<span style="color: #ff1493;">)</span> <span style="color: #ff1493;">(</span><span style="color: #DCDCCC; font-weight: bold;">++</span> i<span style="color: #ff1493;">)</span><span style="color: #ff8c00;">)</span>
</pre>
</div>

<p>
Numerical for:
</p>

<div class="org-src-container">
<pre class="src src-octaspire-dern"><span style="color: #ff8c00;">(</span><span style="color: #DCDCCC; font-weight: bold;">for</span> i from <span style="color: #ff1493;">{</span>D+0<span style="color: #ff1493;">}</span> to <span style="color: #ff1493;">{</span>D+10<span style="color: #ff1493;">}</span> <span style="color: #ff1493;">(</span><span style="color: #DCDCCC; font-weight: bold;">println</span> <span style="color: #CC9393;">[Hello {}!]</span> i<span style="color: #ff1493;">)</span><span style="color: #ff8c00;">)</span>
</pre>
</div>

<p>
Container for:
</p>

<div class="org-src-container">
<pre class="src src-octaspire-dern"><span style="color: #ff8c00;">(</span><span style="color: #DCDCCC; font-weight: bold;">define</span> names <span style="color: #DCDCCC; font-weight: bold;">as</span> '<span style="color: #ff1493;">(</span>John Mark Lisa<span style="color: #ff1493;">)</span> <span style="color: #CC9393;">[names list]</span><span style="color: #ff8c00;">)</span>
<span style="color: #ff8c00;">(</span><span style="color: #DCDCCC; font-weight: bold;">for</span> i <span style="color: #DCDCCC; font-weight: bold;">in</span> names <span style="color: #ff1493;">(</span><span style="color: #DCDCCC; font-weight: bold;">println</span> <span style="color: #CC9393;">[Hello {} World!]</span> i<span style="color: #ff1493;">)</span><span style="color: #ff8c00;">)</span>
</pre>
</div>

<p>
Both the <b>numerical for</b> and <b>container for</b> support the use of optional <code>step</code> to change the
way the iterator is incremented:
</p>

<div class="org-src-container">
<pre class="src src-octaspire-dern"><span style="color: #ff8c00;">(</span><span style="color: #DCDCCC; font-weight: bold;">for</span> i from <span style="color: #ff1493;">{</span>D+0<span style="color: #ff1493;">}</span> to <span style="color: #ff1493;">{</span>D+10<span style="color: #ff1493;">}</span> step <span style="color: #ff1493;">{</span>D+3<span style="color: #ff1493;">}</span>
  <span style="color: #ff1493;">(</span><span style="color: #DCDCCC; font-weight: bold;">println</span> <span style="color: #CC9393;">[Hello {}!]</span> i<span style="color: #ff1493;">)</span><span style="color: #ff8c00;">)</span>

<span style="color: #ff8c00;">(</span><span style="color: #DCDCCC; font-weight: bold;">define</span> names <span style="color: #DCDCCC; font-weight: bold;">as</span> '<span style="color: #ff1493;">(</span>John Mark Lisa<span style="color: #ff1493;">)</span> <span style="color: #CC9393;">[names list]</span><span style="color: #ff8c00;">)</span>
<span style="color: #ff8c00;">(</span><span style="color: #DCDCCC; font-weight: bold;">for</span> i <span style="color: #DCDCCC; font-weight: bold;">in</span> names step <span style="color: #ff1493;">{</span>D+2<span style="color: #ff1493;">}</span>
  <span style="color: #ff1493;">(</span><span style="color: #DCDCCC; font-weight: bold;">println</span> <span style="color: #CC9393;">[Hello {} World!]</span> i<span style="color: #ff1493;">)</span><span style="color: #ff8c00;">)</span>
</pre>
</div>
</div>
</div>
