release/documentation/dern-manual.html

<div id="outline-container-orga21a9d3" class="outline-2">
<h2 id="orga21a9d3"><span class="section-number-2">8</span> Comparing and changing values, predicates</h2>
<div class="outline-text-2" id="text-8">
<p>
Here are few examples:
</p>

<div class="org-src-container">
<pre class="src src-octaspire-dern"><span style="color: #ff8c00;">(</span><span style="color: #DCDCCC; font-weight: bold;">&lt;</span>  <span style="color: #ff1493;">{</span>D+1<span style="color: #ff1493;">}</span> <span style="color: #ff1493;">{</span>D+2<span style="color: #ff1493;">}</span><span style="color: #ff8c00;">)</span>   <span style="color: #7F9F7F;">; true</span>
<span style="color: #ff8c00;">(</span><span style="color: #DCDCCC; font-weight: bold;">&lt;</span>  <span style="color: #ff1493;">{</span>D+2<span style="color: #ff1493;">}</span> <span style="color: #ff1493;">{</span>D+2<span style="color: #ff1493;">}</span><span style="color: #ff8c00;">)</span>   <span style="color: #7F9F7F;">; false</span>
<span style="color: #ff8c00;">(</span><span style="color: #DCDCCC; font-weight: bold;">&gt;</span>  <span style="color: #ff1493;">{</span>D+2<span style="color: #ff1493;">}</span> <span style="color: #ff1493;">{</span>D+1<span style="color: #ff1493;">}</span><span style="color: #ff8c00;">)</span>   <span style="color: #7F9F7F;">; true</span>
<span style="color: #ff8c00;">(</span><span style="color: #DCDCCC; font-weight: bold;">&lt;=</span> <span style="color: #ff1493;">{</span>D+1<span style="color: #ff1493;">}</span> <span style="color: #ff1493;">{</span>D+1<span style="color: #ff1493;">}</span><span style="color: #ff8c00;">)</span>   <span style="color: #7F9F7F;">; true</span>
<span style="color: #ff8c00;">(</span><span style="color: #DCDCCC; font-weight: bold;">&gt;=</span> <span style="color: #ff1493;">{</span>D+1<span style="color: #ff1493;">}</span> <span style="color: #ff1493;">{</span>D+1<span style="color: #ff1493;">}</span><span style="color: #ff8c00;">)</span>   <span style="color: #7F9F7F;">; true</span>
<span style="color: #ff8c00;">(</span><span style="color: #DCDCCC; font-weight: bold;">==</span> <span style="color: #ff1493;">{</span>D+3<span style="color: #ff1493;">}</span> <span style="color: #ff1493;">{</span>D+3<span style="color: #ff1493;">}</span><span style="color: #ff8c00;">)</span>   <span style="color: #7F9F7F;">; true</span>
<span style="color: #ff8c00;">(</span><span style="color: #DCDCCC; font-weight: bold;">==</span> <span style="color: #ff1493;">{</span>D+3<span style="color: #ff1493;">}</span> <span style="color: #ff1493;">{</span>D+1<span style="color: #ff1493;">}</span><span style="color: #ff8c00;">)</span>   <span style="color: #7F9F7F;">; false</span>
<span style="color: #ff8c00;">(</span>!<span style="color: #DCDCCC; font-weight: bold;">=</span> <span style="color: #ff1493;">{</span>D+3<span style="color: #ff1493;">}</span> <span style="color: #ff1493;">{</span>D+1<span style="color: #ff1493;">}</span><span style="color: #ff8c00;">)</span>   <span style="color: #7F9F7F;">; true</span>
<span style="color: #ff8c00;">(</span><span style="color: #DCDCCC; font-weight: bold;">+</span> <span style="color: #ff1493;">{</span>D+1<span style="color: #ff1493;">}</span><span style="color: #ff8c00;">)</span>      <span style="color: #7F9F7F;">;  1</span>
<span style="color: #ff8c00;">(</span><span style="color: #DCDCCC; font-weight: bold;">+</span> <span style="color: #ff1493;">{</span>D+1<span style="color: #ff1493;">}</span> <span style="color: #ff1493;">{</span>D+1<span style="color: #ff1493;">}</span><span style="color: #ff8c00;">)</span>    <span style="color: #7F9F7F;">;  2</span>
<span style="color: #ff8c00;">(</span><span style="color: #DCDCCC; font-weight: bold;">-</span> <span style="color: #ff1493;">{</span>D+1<span style="color: #ff1493;">}</span><span style="color: #ff8c00;">)</span>      <span style="color: #7F9F7F;">; -1</span>
<span style="color: #ff8c00;">(</span><span style="color: #DCDCCC; font-weight: bold;">-</span> <span style="color: #ff1493;">{</span>D+1<span style="color: #ff1493;">}</span> <span style="color: #ff1493;">{</span>D+2<span style="color: #ff1493;">}</span> <span style="color: #ff1493;">{</span>D+3<span style="color: #ff1493;">}</span><span style="color: #ff8c00;">)</span>  <span style="color: #7F9F7F;">; -4</span>

<span style="color: #ff8c00;">(</span><span style="color: #DCDCCC; font-weight: bold;">not</span> <span style="color: #BFEBBF;">true</span><span style="color: #ff8c00;">)</span>     <span style="color: #7F9F7F;">; false</span>

<span style="color: #ff8c00;">(</span><span style="color: #DCDCCC; font-weight: bold;">uid</span> <span style="color: #DCDCCC; font-weight: bold;">+</span><span style="color: #ff8c00;">)</span>        <span style="color: #7F9F7F;">; unique id of +</span>
<span style="color: #ff8c00;">(</span><span style="color: #DCDCCC; font-weight: bold;">===</span> <span style="color: #DCDCCC; font-weight: bold;">+</span> <span style="color: #DCDCCC; font-weight: bold;">+</span><span style="color: #ff8c00;">)</span>      <span style="color: #7F9F7F;">; compare using unique id</span>

<span style="color: #ff8c00;">(</span><span style="color: #DCDCCC; font-weight: bold;">len</span> '<span style="color: #ff1493;">(</span><span style="color: #7fff00;">{</span>D+1<span style="color: #7fff00;">}</span> <span style="color: #7fff00;">{</span>D+2<span style="color: #7fff00;">}</span> <span style="color: #7fff00;">{</span>D+3<span style="color: #7fff00;">}</span><span style="color: #ff1493;">)</span><span style="color: #ff8c00;">)</span>  <span style="color: #7F9F7F;">; length of vector:   3</span>
<span style="color: #ff8c00;">(</span><span style="color: #DCDCCC; font-weight: bold;">len</span> <span style="color: #CC9393;">[abc]</span><span style="color: #ff8c00;">)</span>                 <span style="color: #7F9F7F;">; length of string:   3</span>
<span style="color: #ff8c00;">(</span><span style="color: #DCDCCC; font-weight: bold;">len</span> <span style="color: #ff1493;">(</span><span style="color: #DCDCCC; font-weight: bold;">hash-map</span> <span style="color: #7fff00;">{</span>D+1<span style="color: #7fff00;">}</span> <span style="color: #CC9393;">|a|</span><span style="color: #ff1493;">)</span><span style="color: #ff8c00;">)</span>  <span style="color: #7F9F7F;">; length of hash-map: 1</span>

<span style="color: #ff8c00;">(</span><span style="color: #DCDCCC; font-weight: bold;">define</span> number <span style="color: #DCDCCC; font-weight: bold;">as</span> <span style="color: #ff1493;">{</span>D+1<span style="color: #ff1493;">}</span> <span style="color: #CC9393;">[my number]</span><span style="color: #ff8c00;">)</span>
<span style="color: #ff8c00;">(</span><span style="color: #DCDCCC; font-weight: bold;">++</span> number<span style="color: #ff8c00;">)</span>                      <span style="color: #7F9F7F;">; number is 2</span>
<span style="color: #ff8c00;">(</span><span style="color: #DCDCCC; font-weight: bold;">--</span> number<span style="color: #ff8c00;">)</span>                      <span style="color: #7F9F7F;">; number is 1</span>
<span style="color: #ff8c00;">(</span><span style="color: #DCDCCC; font-weight: bold;">+=</span> number <span style="color: #ff1493;">{</span>D+2<span style="color: #ff1493;">}</span><span style="color: #ff8c00;">)</span>                <span style="color: #7F9F7F;">; number is 3</span>

<span style="color: #ff8c00;">(</span><span style="color: #DCDCCC; font-weight: bold;">+</span> <span style="color: #CC9393;">[Hello]</span> <span style="color: #CC9393;">[ ]</span> <span style="color: #CC9393;">[World.]</span> <span style="color: #CC9393;">[ Bye.]</span><span style="color: #ff8c00;">)</span> <span style="color: #7F9F7F;">; Hello World. Bye.</span>

<span style="color: #ff8c00;">(</span><span style="color: #DCDCCC; font-weight: bold;">define</span> greeting <span style="color: #DCDCCC; font-weight: bold;">as</span> <span style="color: #CC9393;">[Hello]</span> <span style="color: #CC9393;">[my greeting]</span><span style="color: #ff8c00;">)</span>
<span style="color: #ff8c00;">(</span><span style="color: #DCDCCC; font-weight: bold;">+=</span> greeting <span style="color: #CC9393;">[ World!]</span><span style="color: #ff8c00;">)</span>          <span style="color: #7F9F7F;">; Hello World!</span>
<span style="color: #ff8c00;">(</span><span style="color: #DCDCCC; font-weight: bold;">+=</span> greeting <span style="color: #CC9393;">|!|</span><span style="color: #ff8c00;">)</span>                <span style="color: #7F9F7F;">; Hello World!!</span>

<span style="color: #ff8c00;">(</span><span style="color: #DCDCCC; font-weight: bold;">+=</span> '<span style="color: #ff1493;">(</span><span style="color: #7fff00;">{</span>D+1<span style="color: #7fff00;">}</span> <span style="color: #7fff00;">{</span>D+2<span style="color: #7fff00;">}</span> <span style="color: #7fff00;">{</span>D+3<span style="color: #7fff00;">}</span><span style="color: #ff1493;">)</span> '<span style="color: #ff1493;">(</span><span style="color: #7fff00;">{</span>D+4<span style="color: #7fff00;">}</span> <span style="color: #7fff00;">{</span>D+5<span style="color: #7fff00;">}</span> <span style="color: #7fff00;">{</span>D+6<span style="color: #7fff00;">}</span><span style="color: #ff1493;">)</span><span style="color: #ff8c00;">)</span>
<span style="color: #7F9F7F;">; (1 2 3 (4 5 6))</span>

<span style="color: #ff8c00;">(</span><span style="color: #DCDCCC; font-weight: bold;">define</span> capitals <span style="color: #DCDCCC; font-weight: bold;">as</span> <span style="color: #ff1493;">(</span><span style="color: #DCDCCC; font-weight: bold;">hash-map</span> <span style="color: #CC9393;">[United Kingdom]</span>
                                <span style="color: #CC9393;">[London]</span>
                              <span style="color: #CC9393;">[Spain]</span> <span style="color: #CC9393;">[Madrid]</span><span style="color: #ff1493;">)</span>
    <span style="color: #CC9393;">[country -&gt; capital]</span><span style="color: #ff8c00;">)</span>
<span style="color: #ff8c00;">(</span><span style="color: #DCDCCC; font-weight: bold;">+=</span> capitals <span style="color: #CC9393;">[Nepal]</span> <span style="color: #CC9393;">[Kathmandu]</span><span style="color: #ff8c00;">)</span>
<span style="color: #ff8c00;">(</span><span style="color: #DCDCCC; font-weight: bold;">+=</span> capitals '<span style="color: #ff1493;">(</span><span style="color: #CC9393;">[Norway]</span> <span style="color: #CC9393;">[Oslo]</span> <span style="color: #CC9393;">[Poland]</span> <span style="color: #CC9393;">[Warsaw]</span><span style="color: #ff1493;">)</span><span style="color: #ff8c00;">)</span>
<span style="color: #ff8c00;">(</span><span style="color: #DCDCCC; font-weight: bold;">+=</span> capitals <span style="color: #ff1493;">(</span><span style="color: #DCDCCC; font-weight: bold;">hash-map</span> <span style="color: #CC9393;">[Peru]</span> <span style="color: #CC9393;">[Lima]</span><span style="color: #ff1493;">)</span><span style="color: #ff8c00;">)</span>

<span style="color: #ff8c00;">(</span><span style="color: #DCDCCC; font-weight: bold;">-=</span> <span style="color: #ff1493;">{</span>D+10<span style="color: #ff1493;">}</span> <span style="color: #ff1493;">{</span>D+1<span style="color: #ff1493;">}</span> <span style="color: #ff1493;">{</span>D+2<span style="color: #ff1493;">}</span> <span style="color: #ff1493;">{</span>D+3<span style="color: #ff1493;">}</span><span style="color: #ff8c00;">)</span>             <span style="color: #7F9F7F;">; 4</span>
<span style="color: #ff8c00;">(</span><span style="color: #DCDCCC; font-weight: bold;">-=</span> <span style="color: #CC9393;">|x|</span> <span style="color: #ff1493;">{</span>D+2<span style="color: #ff1493;">}</span><span style="color: #ff8c00;">)</span>                            <span style="color: #7F9F7F;">; |v|</span>
<span style="color: #ff8c00;">(</span><span style="color: #DCDCCC; font-weight: bold;">-=</span> <span style="color: #CC9393;">|x|</span> <span style="color: #CC9393;">|!|</span><span style="color: #ff8c00;">)</span>                              <span style="color: #7F9F7F;">; |W|</span>
<span style="color: #ff8c00;">(</span><span style="color: #DCDCCC; font-weight: bold;">-=</span> <span style="color: #CC9393;">[abba]</span> <span style="color: #CC9393;">|a|</span><span style="color: #ff8c00;">)</span>                           <span style="color: #7F9F7F;">; [bb]</span>

<span style="color: #ff8c00;">(</span><span style="color: #DCDCCC; font-weight: bold;">-=</span> <span style="color: #ff1493;">(</span><span style="color: #DCDCCC; font-weight: bold;">hash-map</span> <span style="color: #7fff00;">{</span>D+1<span style="color: #7fff00;">}</span> <span style="color: #CC9393;">|a|</span> <span style="color: #7fff00;">{</span>D+2<span style="color: #7fff00;">}</span> <span style="color: #CC9393;">|b|</span><span style="color: #ff1493;">)</span> <span style="color: #ff1493;">{</span>D+1<span style="color: #ff1493;">}</span><span style="color: #ff8c00;">)</span>
<span style="color: #7F9F7F;">; (hash-map 2 |b|)</span>

<span style="color: #ff8c00;">(</span><span style="color: #DCDCCC; font-weight: bold;">-=</span> '<span style="color: #ff1493;">(</span><span style="color: #7fff00;">{</span>D+1<span style="color: #7fff00;">}</span> <span style="color: #7fff00;">{</span>D+1<span style="color: #7fff00;">}</span> <span style="color: #7fff00;">{</span>D+2<span style="color: #7fff00;">}</span> <span style="color: #7fff00;">{</span>D+2<span style="color: #7fff00;">}</span> <span style="color: #7fff00;">{</span>D+3<span style="color: #7fff00;">}</span><span style="color: #ff1493;">)</span> <span style="color: #ff1493;">{</span>D+1<span style="color: #ff1493;">}</span> <span style="color: #ff1493;">{</span>D+2<span style="color: #ff1493;">}</span><span style="color: #ff8c00;">)</span>
<span style="color: #7F9F7F;">; (3)</span>

<span style="color: #ff8c00;">(</span><span style="color: #DCDCCC; font-weight: bold;">define</span> v <span style="color: #DCDCCC; font-weight: bold;">as</span> '<span style="color: #ff1493;">(</span><span style="color: #7fff00;">{</span>D+1<span style="color: #7fff00;">}</span> <span style="color: #7fff00;">{</span>D+2<span style="color: #7fff00;">}</span> <span style="color: #7fff00;">{</span>D+3<span style="color: #7fff00;">}</span> <span style="color: #7fff00;">{</span>D+3<span style="color: #7fff00;">}</span><span style="color: #ff1493;">)</span> <span style="color: #CC9393;">[v]</span><span style="color: #ff8c00;">)</span>
<span style="color: #ff8c00;">(</span><span style="color: #DCDCCC; font-weight: bold;">-=</span> v <span style="color: #ff1493;">(</span>ln@ v <span style="color: #7fff00;">{</span>D-1<span style="color: #7fff00;">}</span><span style="color: #ff1493;">)</span><span style="color: #ff8c00;">)</span>             <span style="color: #7F9F7F;">; (1 2)</span>

<span style="color: #ff8c00;">(</span><span style="color: #DCDCCC; font-weight: bold;">define</span> v <span style="color: #DCDCCC; font-weight: bold;">as</span> '<span style="color: #ff1493;">(</span><span style="color: #7fff00;">{</span>D+1<span style="color: #7fff00;">}</span> <span style="color: #7fff00;">{</span>D+2<span style="color: #7fff00;">}</span> <span style="color: #7fff00;">{</span>D+3<span style="color: #7fff00;">}</span> <span style="color: #7fff00;">{</span>D+3<span style="color: #7fff00;">}</span><span style="color: #ff1493;">)</span> <span style="color: #CC9393;">[v]</span><span style="color: #ff8c00;">)</span>
<span style="color: #ff8c00;">(</span><span style="color: #DCDCCC; font-weight: bold;">-==</span> v <span style="color: #ff1493;">(</span>ln@ v <span style="color: #7fff00;">{</span>D-1<span style="color: #7fff00;">}</span><span style="color: #ff1493;">)</span><span style="color: #ff8c00;">)</span>            <span style="color: #7F9F7F;">; (1 2 3)</span>
</pre>
</div>

<p>
Operators <code>++</code>, <code>--</code>, <code>+=</code>, <code>-=</code>, <code>==</code> and <code>!=</code> are similar to those in C. Note also that
<b>the operands need not to be numbers</b>. You can, for example, use <code>+=</code> to push values to the
back of a vector, add characters into a string, write values into a port, etc.
<code>-==</code> removes values from a supported collection by comparing the unique identifiers
of values. It removes only values that are the same (equal values might not be the
same).
</p>

<p>
Please note: all the examples above should work, but support for non-numeric types is not finished
on most of the operators. Using those operators with non-numeric arguments
aborts the program or returns error. Complete support for non numeric operands
for the above operators should be implemented in the standard library eventually.
</p>
</div>
</div>
