dev/doc/book/dern-manual.org
** Removing the last value from a vector

Compare these two cases:

#+BEGIN_SRC octaspire-dern
(define v as '({D+1} {D+2} {D+3} {D+3}) [v])
(-= v (ln@ v {D-1}))             ; (1 2)

(define v as '({D+1} {D+2} {D+3} {D+3}) [v])
(-== v (ln@ v {D-1}))            ; (1 2 3)
#+END_SRC

The last example removes really only the last value (compared using ~===~).
The first example removes all the values that are equal to the last value
(compared using ~==~).

Values can be removed this way from any position by using different indices.
As with other functions, negative indices count from the end of the collection
and positive from the beginning.

More efficient way of removing the last value from a collection is to use
the builtin =pop-back=:

#+BEGIN_SRC octaspire-dern
(define v as '({D+1} {D+2} {D+3} {D+3}) [v])
(pop-back v)                  ; (1 2 3)
#+END_SRC

** Branching and selection

Here are some examples using =if=:

#+BEGIN_SRC octaspire-dern
(if true  [Yes])         ; Yes
(if false [Yes])         ; nil
(if false [Yes] [No])    ; No

(if true  (println [Yes]) (println [No]))
; Prints Yes

; Prints Yes|newline|OK
(if true  (do (println [Yes]) (println [OK])))
#+END_SRC

Here are some examples using =select=:

#+BEGIN_SRC octaspire-dern
(select true [Yes])            ; Yes

(select false [No]
        true  [Yes])           ; Yes

(select default [Yes])         ; Yes

(select false   [No]
        default [Yes])         ; Yes

(select false   [No]
        true    [Maybe]
        default [Yes])         ; Maybe

(select false [Yes])           ; nil


(define f1 as (fn () true)  [f1] '() howto-no)
(define f2 as (fn () false) [f2] '() howto-no)

(select (f1)  [Yes]
        (f2)  [No]
        false [Maybe])         ; Yes

; Prints: Sun is shining
(select (f1)  (println [Sun is shining])
        (f2)  (println [It rains])
        false [Maybe]
        false {D+2}
        false {D+3.14}
        false |a|
        false [There can be many selectors...])
#+END_SRC

