release/documentation/dern-manual.html

<div id="outline-container-orgc06e440" class="outline-2">
<h2 id="orgc06e440"><span class="section-number-2">9</span> Removing the last value from a vector</h2>
<div class="outline-text-2" id="text-9">
<p>
Compare these two cases:
</p>

<div class="org-src-container">
<pre class="src src-octaspire-dern"><span style="color: #ff8c00;">(</span><span style="color: #DCDCCC; font-weight: bold;">define</span> v <span style="color: #DCDCCC; font-weight: bold;">as</span> '<span style="color: #ff1493;">(</span><span style="color: #7fff00;">{</span>D+1<span style="color: #7fff00;">}</span> <span style="color: #7fff00;">{</span>D+2<span style="color: #7fff00;">}</span> <span style="color: #7fff00;">{</span>D+3<span style="color: #7fff00;">}</span> <span style="color: #7fff00;">{</span>D+3<span style="color: #7fff00;">}</span><span style="color: #ff1493;">)</span> <span style="color: #CC9393;">[v]</span><span style="color: #ff8c00;">)</span>
<span style="color: #ff8c00;">(</span><span style="color: #DCDCCC; font-weight: bold;">-=</span> v <span style="color: #ff1493;">(</span>ln@ v <span style="color: #7fff00;">{</span>D-1<span style="color: #7fff00;">}</span><span style="color: #ff1493;">)</span><span style="color: #ff8c00;">)</span>             <span style="color: #7F9F7F;">; (1 2)</span>

<span style="color: #ff8c00;">(</span><span style="color: #DCDCCC; font-weight: bold;">define</span> v <span style="color: #DCDCCC; font-weight: bold;">as</span> '<span style="color: #ff1493;">(</span><span style="color: #7fff00;">{</span>D+1<span style="color: #7fff00;">}</span> <span style="color: #7fff00;">{</span>D+2<span style="color: #7fff00;">}</span> <span style="color: #7fff00;">{</span>D+3<span style="color: #7fff00;">}</span> <span style="color: #7fff00;">{</span>D+3<span style="color: #7fff00;">}</span><span style="color: #ff1493;">)</span> <span style="color: #CC9393;">[v]</span><span style="color: #ff8c00;">)</span>
<span style="color: #ff8c00;">(</span><span style="color: #DCDCCC; font-weight: bold;">-==</span> v <span style="color: #ff1493;">(</span>ln@ v <span style="color: #7fff00;">{</span>D-1<span style="color: #7fff00;">}</span><span style="color: #ff1493;">)</span><span style="color: #ff8c00;">)</span>            <span style="color: #7F9F7F;">; (1 2 3)</span>
</pre>
</div>

<p>
The last example removes really only the last value (compared using <code>===</code>).
The first example removes all the values that are equal to the last value
(compared using <code>==</code>).
</p>

<p>
Values can be removed this way from any position by using different indices.
As with other functions, negative indices count from the end of the collection
and positive from the beginning.
</p>

<p>
More efficient way of removing the last value from a collection is to use
the builtin <code>pop-back</code>:
</p>

<div class="org-src-container">
<pre class="src src-octaspire-dern"><span style="color: #ff8c00;">(</span><span style="color: #DCDCCC; font-weight: bold;">define</span> v <span style="color: #DCDCCC; font-weight: bold;">as</span> '<span style="color: #ff1493;">(</span><span style="color: #7fff00;">{</span>D+1<span style="color: #7fff00;">}</span> <span style="color: #7fff00;">{</span>D+2<span style="color: #7fff00;">}</span> <span style="color: #7fff00;">{</span>D+3<span style="color: #7fff00;">}</span> <span style="color: #7fff00;">{</span>D+3<span style="color: #7fff00;">}</span><span style="color: #ff1493;">)</span> <span style="color: #CC9393;">[v]</span><span style="color: #ff8c00;">)</span>
<span style="color: #ff8c00;">(</span><span style="color: #DCDCCC; font-weight: bold;">pop-back</span> v<span style="color: #ff8c00;">)</span>                  <span style="color: #7F9F7F;">; (1 2 3)</span>
</pre>
</div>
</div>
</div>

<div id="outline-container-orgaf624fc" class="outline-2">
<h2 id="orgaf624fc"><span class="section-number-2">10</span> Branching and selection</h2>
<div class="outline-text-2" id="text-10">
<p>
Here are some examples using <code>if</code>:
</p>

<div class="org-src-container">
<pre class="src src-octaspire-dern"><span style="color: #ff8c00;">(</span><span style="color: #DCDCCC; font-weight: bold;">if</span> <span style="color: #BFEBBF;">true</span>  <span style="color: #CC9393;">[Yes]</span><span style="color: #ff8c00;">)</span>         <span style="color: #7F9F7F;">; Yes</span>
<span style="color: #ff8c00;">(</span><span style="color: #DCDCCC; font-weight: bold;">if</span> <span style="color: #BFEBBF;">false</span> <span style="color: #CC9393;">[Yes]</span><span style="color: #ff8c00;">)</span>         <span style="color: #7F9F7F;">; nil</span>
<span style="color: #ff8c00;">(</span><span style="color: #DCDCCC; font-weight: bold;">if</span> <span style="color: #BFEBBF;">false</span> <span style="color: #CC9393;">[Yes]</span> <span style="color: #CC9393;">[No]</span><span style="color: #ff8c00;">)</span>    <span style="color: #7F9F7F;">; No</span>

<span style="color: #ff8c00;">(</span><span style="color: #DCDCCC; font-weight: bold;">if</span> <span style="color: #BFEBBF;">true</span>  <span style="color: #ff1493;">(</span><span style="color: #DCDCCC; font-weight: bold;">println</span> <span style="color: #CC9393;">[Yes]</span><span style="color: #ff1493;">)</span> <span style="color: #ff1493;">(</span><span style="color: #DCDCCC; font-weight: bold;">println</span> <span style="color: #CC9393;">[No]</span><span style="color: #ff1493;">)</span><span style="color: #ff8c00;">)</span>
<span style="color: #7F9F7F;">; Prints Yes</span>

<span style="color: #7F9F7F;">; Prints Yes|newline|OK</span>
<span style="color: #ff8c00;">(</span><span style="color: #DCDCCC; font-weight: bold;">if</span> <span style="color: #BFEBBF;">true</span>  <span style="color: #ff1493;">(</span><span style="color: #DCDCCC; font-weight: bold;">do</span> <span style="color: #7fff00;">(</span><span style="color: #DCDCCC; font-weight: bold;">println</span> <span style="color: #CC9393;">[Yes]</span><span style="color: #7fff00;">)</span> <span style="color: #7fff00;">(</span><span style="color: #DCDCCC; font-weight: bold;">println</span> <span style="color: #CC9393;">[OK]</span><span style="color: #7fff00;">)</span><span style="color: #ff1493;">)</span><span style="color: #ff8c00;">)</span>
</pre>
</div>

<p>
Here are some examples using <code>select</code>:
</p>

<div class="org-src-container">
<pre class="src src-octaspire-dern"><span style="color: #ff8c00;">(</span><span style="color: #DCDCCC; font-weight: bold;">select</span> <span style="color: #BFEBBF;">true</span> <span style="color: #CC9393;">[Yes]</span><span style="color: #ff8c00;">)</span>            <span style="color: #7F9F7F;">; Yes</span>

<span style="color: #ff8c00;">(</span><span style="color: #DCDCCC; font-weight: bold;">select</span> <span style="color: #BFEBBF;">false</span> <span style="color: #CC9393;">[No]</span>
        <span style="color: #BFEBBF;">true</span>  <span style="color: #CC9393;">[Yes]</span><span style="color: #ff8c00;">)</span>           <span style="color: #7F9F7F;">; Yes</span>

<span style="color: #ff8c00;">(</span><span style="color: #DCDCCC; font-weight: bold;">select</span> default <span style="color: #CC9393;">[Yes]</span><span style="color: #ff8c00;">)</span>         <span style="color: #7F9F7F;">; Yes</span>

<span style="color: #ff8c00;">(</span><span style="color: #DCDCCC; font-weight: bold;">select</span> <span style="color: #BFEBBF;">false</span>   <span style="color: #CC9393;">[No]</span>
        default <span style="color: #CC9393;">[Yes]</span><span style="color: #ff8c00;">)</span>         <span style="color: #7F9F7F;">; Yes</span>

<span style="color: #ff8c00;">(</span><span style="color: #DCDCCC; font-weight: bold;">select</span> <span style="color: #BFEBBF;">false</span>   <span style="color: #CC9393;">[No]</span>
        <span style="color: #BFEBBF;">true</span>    <span style="color: #CC9393;">[Maybe]</span>
        default <span style="color: #CC9393;">[Yes]</span><span style="color: #ff8c00;">)</span>         <span style="color: #7F9F7F;">; Maybe</span>

<span style="color: #ff8c00;">(</span><span style="color: #DCDCCC; font-weight: bold;">select</span> <span style="color: #BFEBBF;">false</span> <span style="color: #CC9393;">[Yes]</span><span style="color: #ff8c00;">)</span>           <span style="color: #7F9F7F;">; nil</span>


<span style="color: #ff8c00;">(</span><span style="color: #DCDCCC; font-weight: bold;">define</span> f1 <span style="color: #DCDCCC; font-weight: bold;">as</span> <span style="color: #ff1493;">(</span><span style="color: #DCDCCC; font-weight: bold;">fn</span> <span style="color: #7fff00;">()</span> <span style="color: #BFEBBF;">true</span><span style="color: #ff1493;">)</span>  <span style="color: #CC9393;">[f1]</span> '<span style="color: #ff1493;">()</span> <span style="color: #DCDCCC; font-weight: bold;">howto-no</span><span style="color: #ff8c00;">)</span>
<span style="color: #ff8c00;">(</span><span style="color: #DCDCCC; font-weight: bold;">define</span> f2 <span style="color: #DCDCCC; font-weight: bold;">as</span> <span style="color: #ff1493;">(</span><span style="color: #DCDCCC; font-weight: bold;">fn</span> <span style="color: #7fff00;">()</span> <span style="color: #BFEBBF;">false</span><span style="color: #ff1493;">)</span> <span style="color: #CC9393;">[f2]</span> '<span style="color: #ff1493;">()</span> <span style="color: #DCDCCC; font-weight: bold;">howto-no</span><span style="color: #ff8c00;">)</span>

<span style="color: #ff8c00;">(</span><span style="color: #DCDCCC; font-weight: bold;">select</span> <span style="color: #ff1493;">(</span>f1<span style="color: #ff1493;">)</span>  <span style="color: #CC9393;">[Yes]</span>
        <span style="color: #ff1493;">(</span>f2<span style="color: #ff1493;">)</span>  <span style="color: #CC9393;">[No]</span>
        <span style="color: #BFEBBF;">false</span> <span style="color: #CC9393;">[Maybe]</span><span style="color: #ff8c00;">)</span>         <span style="color: #7F9F7F;">; Yes</span>

<span style="color: #7F9F7F;">; Prints: Sun is shining</span>
<span style="color: #ff8c00;">(</span><span style="color: #DCDCCC; font-weight: bold;">select</span> <span style="color: #ff1493;">(</span>f1<span style="color: #ff1493;">)</span>  <span style="color: #ff1493;">(</span><span style="color: #DCDCCC; font-weight: bold;">println</span> <span style="color: #CC9393;">[Sun is shining]</span><span style="color: #ff1493;">)</span>
        <span style="color: #ff1493;">(</span>f2<span style="color: #ff1493;">)</span>  <span style="color: #ff1493;">(</span><span style="color: #DCDCCC; font-weight: bold;">println</span> <span style="color: #CC9393;">[It rains]</span><span style="color: #ff1493;">)</span>
        <span style="color: #BFEBBF;">false</span> <span style="color: #CC9393;">[Maybe]</span>
        <span style="color: #BFEBBF;">false</span> <span style="color: #ff1493;">{</span>D+2<span style="color: #ff1493;">}</span>
        <span style="color: #BFEBBF;">false</span> <span style="color: #ff1493;">{</span>D+3.14<span style="color: #ff1493;">}</span>
        <span style="color: #BFEBBF;">false</span> <span style="color: #CC9393;">|a|</span>
        <span style="color: #BFEBBF;">false</span> <span style="color: #CC9393;">[There can be many selectors...]</span><span style="color: #ff8c00;">)</span>
</pre>
</div>
</div>
</div>
