dev/doc/book/dern-manual.org
** Selecting values from collections

Values can be selected from collections using =ln@= and copied with =cp@=.
=ln@= is pronounced *link at* and =cp@= is pronounced *copy at*.

#+BEGIN_SRC octaspire-dern
(++ (ln@ '({D+1} {D+2} {D+3}) {D+1}))   ; 3
(+= (cp@ [abc] {D+1}) {D+2}))           ; |d|
(ln@ (hash-map |a| [abc]) |a|   'hash)  ; [abc]
(ln@ (hash-map |a| [abc]) {D+0} 'index) ; [abc]
#+END_SRC

** Accessing and manipulating command line arguments and environment variables

This section is not ready yet. See the example below. More information will
be added later.

#+BEGIN_SRC octaspire-dern
(host-get-command-line-arguments)
(host-get-environment-variables)
#+END_SRC

** Formatted and regular printing

Here are few examples:

#+BEGIN_SRC octaspire-dern
(print   [Hi])   ; Prints Hi without newline
(println [Hi])   ; Prints Hi and newline

(define name1  as 'Jim   [some name 1])
(define name2  as 'Alice [some name 2])
(define number as {D+30} [some number])

; Prints Hi Jim and Alice! It is 30 degrees outside.
(println [Hi {} and {}! It is {} degrees outside.]
    name1 name2 number)
#+END_SRC

** Formatted string creation

Here are few examples:

#+BEGIN_SRC octaspire-dern
(define name1  as 'Jim   [some name 1])
(define name2  as 'Alice [some name 2])
(define number as {D+30} [some number])

; Creates a sting
; [Hi Jim and Alice! It is 30 degrees outside]
(string-format
  [Hi {} and {}! It is {} degrees outside]
  name1 name2 number)
#+END_SRC

** Functions with variable number of arguments

Here are few examples:

#+BEGIN_SRC octaspire-dern
(define f as (fn (x ...) x) [f]
    '(x [x] ... [varargs]) howto-no)

(f {D+1} {D+2} {D+3})   ; (1 2 3)


(define f as (fn (x y ...) (println x) (println y))
    [f] '(x [x] y [rest of the args] ... [varargs])
    howto-no)

(f {D+1} {D+2} {D+3})   ; Prints 1|newline|(2 3)
#+END_SRC

** Environments

Here are few examples:

#+BEGIN_SRC octaspire-dern
(env-global)
(env-current)
(env-new)
#+END_SRC

