release/documentation/dern-manual.html

<div id="outline-container-org78c66a5" class="outline-2">
<h2 id="org78c66a5"><span class="section-number-2">11</span> Selecting values from collections</h2>
<div class="outline-text-2" id="text-11">
<p>
Values can be selected from collections using <code>ln@</code> and copied with <code>cp@</code>.
<code>ln@</code> is pronounced <b>link at</b> and <code>cp@</code> is pronounced <b>copy at</b>.
</p>

<div class="org-src-container">
<pre class="src src-octaspire-dern"><span style="color: #ff8c00;">(</span><span style="color: #DCDCCC; font-weight: bold;">++</span> <span style="color: #ff1493;">(</span>ln@ '<span style="color: #7fff00;">(</span><span style="color: #00bfff;">{</span>D+1<span style="color: #00bfff;">}</span> <span style="color: #00bfff;">{</span>D+2<span style="color: #00bfff;">}</span> <span style="color: #00bfff;">{</span>D+3<span style="color: #00bfff;">}</span><span style="color: #7fff00;">)</span> <span style="color: #7fff00;">{</span>D+1<span style="color: #7fff00;">}</span><span style="color: #ff1493;">)</span><span style="color: #ff8c00;">)</span>   <span style="color: #7F9F7F;">; 3</span>
<span style="color: #ff8c00;">(</span><span style="color: #DCDCCC; font-weight: bold;">+=</span> <span style="color: #ff1493;">(</span>cp@ <span style="color: #CC9393;">[abc]</span> <span style="color: #7fff00;">{</span>D+1<span style="color: #7fff00;">}</span><span style="color: #ff1493;">)</span> <span style="color: #ff1493;">{</span>D+2<span style="color: #ff1493;">}</span><span style="color: #ff8c00;">)</span><span style="color: #88090B;">)</span>           <span style="color: #7F9F7F;">; |d|</span>
<span style="color: #88090B;">(</span>ln@ <span style="color: #ff8c00;">(</span><span style="color: #DCDCCC; font-weight: bold;">hash-map</span> <span style="color: #CC9393;">|a|</span> <span style="color: #CC9393;">[abc]</span><span style="color: #ff8c00;">)</span> <span style="color: #CC9393;">|a|</span>   'hash<span style="color: #88090B;">)</span>  <span style="color: #7F9F7F;">; [abc]</span>
<span style="color: #88090B;">(</span>ln@ <span style="color: #ff8c00;">(</span><span style="color: #DCDCCC; font-weight: bold;">hash-map</span> <span style="color: #CC9393;">|a|</span> <span style="color: #CC9393;">[abc]</span><span style="color: #ff8c00;">)</span> <span style="color: #ff8c00;">{</span>D+0<span style="color: #ff8c00;">}</span> 'index<span style="color: #88090B;">)</span> <span style="color: #7F9F7F;">; [abc]</span>
</pre>
</div>
</div>
</div>

<div id="outline-container-orgf768510" class="outline-2">
<h2 id="orgf768510"><span class="section-number-2">12</span> Accessing and manipulating command line arguments and environment variables</h2>
<div class="outline-text-2" id="text-12">
<p>
This section is not ready yet. See the example below. More information will
be added later.
</p>

<div class="org-src-container">
<pre class="src src-octaspire-dern"><span style="color: #ff8c00;">(</span>host-get-command-line-arguments<span style="color: #ff8c00;">)</span>
<span style="color: #ff8c00;">(</span>host-get-environment-variables<span style="color: #ff8c00;">)</span>
</pre>
</div>
</div>
</div>

<div id="outline-container-orgf84a2ac" class="outline-2">
<h2 id="orgf84a2ac"><span class="section-number-2">13</span> Formatted and regular printing</h2>
<div class="outline-text-2" id="text-13">
<p>
Here are few examples:
</p>

<div class="org-src-container">
<pre class="src src-octaspire-dern"><span style="color: #ff8c00;">(</span><span style="color: #DCDCCC; font-weight: bold;">print</span>   <span style="color: #CC9393;">[Hi]</span><span style="color: #ff8c00;">)</span>   <span style="color: #7F9F7F;">; Prints Hi without newline</span>
<span style="color: #ff8c00;">(</span><span style="color: #DCDCCC; font-weight: bold;">println</span> <span style="color: #CC9393;">[Hi]</span><span style="color: #ff8c00;">)</span>   <span style="color: #7F9F7F;">; Prints Hi and newline</span>

<span style="color: #ff8c00;">(</span><span style="color: #DCDCCC; font-weight: bold;">define</span> name1  <span style="color: #DCDCCC; font-weight: bold;">as</span> 'Jim   <span style="color: #CC9393;">[some name 1]</span><span style="color: #ff8c00;">)</span>
<span style="color: #ff8c00;">(</span><span style="color: #DCDCCC; font-weight: bold;">define</span> name2  <span style="color: #DCDCCC; font-weight: bold;">as</span> 'Alice <span style="color: #CC9393;">[some name 2]</span><span style="color: #ff8c00;">)</span>
<span style="color: #ff8c00;">(</span><span style="color: #DCDCCC; font-weight: bold;">define</span> number <span style="color: #DCDCCC; font-weight: bold;">as</span> <span style="color: #ff1493;">{</span>D+30<span style="color: #ff1493;">}</span> <span style="color: #CC9393;">[some number]</span><span style="color: #ff8c00;">)</span>

<span style="color: #7F9F7F;">; Prints Hi Jim and Alice! It is 30 degrees outside.</span>
<span style="color: #ff8c00;">(</span><span style="color: #DCDCCC; font-weight: bold;">println</span> <span style="color: #CC9393;">[Hi {} and {}! It is {} degrees outside.]</span>
    name1 name2 number<span style="color: #ff8c00;">)</span>
</pre>
</div>
</div>
</div>

<div id="outline-container-org6042b7f" class="outline-2">
<h2 id="org6042b7f"><span class="section-number-2">14</span> Formatted string creation</h2>
<div class="outline-text-2" id="text-14">
<p>
Here are few examples:
</p>

<div class="org-src-container">
<pre class="src src-octaspire-dern"><span style="color: #ff8c00;">(</span><span style="color: #DCDCCC; font-weight: bold;">define</span> name1  <span style="color: #DCDCCC; font-weight: bold;">as</span> 'Jim   <span style="color: #CC9393;">[some name 1]</span><span style="color: #ff8c00;">)</span>
<span style="color: #ff8c00;">(</span><span style="color: #DCDCCC; font-weight: bold;">define</span> name2  <span style="color: #DCDCCC; font-weight: bold;">as</span> 'Alice <span style="color: #CC9393;">[some name 2]</span><span style="color: #ff8c00;">)</span>
<span style="color: #ff8c00;">(</span><span style="color: #DCDCCC; font-weight: bold;">define</span> number <span style="color: #DCDCCC; font-weight: bold;">as</span> <span style="color: #ff1493;">{</span>D+30<span style="color: #ff1493;">}</span> <span style="color: #CC9393;">[some number]</span><span style="color: #ff8c00;">)</span>

<span style="color: #7F9F7F;">; Creates a sting</span>
<span style="color: #7F9F7F;">; [Hi Jim and Alice! It is 30 degrees outside]</span>
<span style="color: #ff8c00;">(</span><span style="color: #DCDCCC; font-weight: bold;">string-format</span>
  <span style="color: #CC9393;">[Hi {} and {}! It is {} degrees outside]</span>
  name1 name2 number<span style="color: #ff8c00;">)</span>
</pre>
</div>
</div>
</div>

<div id="outline-container-orgbb97136" class="outline-2">
<h2 id="orgbb97136"><span class="section-number-2">15</span> Functions with variable number of arguments</h2>
<div class="outline-text-2" id="text-15">
<p>
Here are few examples:
</p>

<div class="org-src-container">
<pre class="src src-octaspire-dern"><span style="color: #ff8c00;">(</span><span style="color: #DCDCCC; font-weight: bold;">define</span> f <span style="color: #DCDCCC; font-weight: bold;">as</span> <span style="color: #ff1493;">(</span><span style="color: #DCDCCC; font-weight: bold;">fn</span> <span style="color: #7fff00;">(</span>x ...<span style="color: #7fff00;">)</span> x<span style="color: #ff1493;">)</span> <span style="color: #CC9393;">[f]</span>
    '<span style="color: #ff1493;">(</span>x <span style="color: #CC9393;">[x]</span> ... <span style="color: #CC9393;">[varargs]</span><span style="color: #ff1493;">)</span> <span style="color: #DCDCCC; font-weight: bold;">howto-no</span><span style="color: #ff8c00;">)</span>

<span style="color: #ff8c00;">(</span>f <span style="color: #ff1493;">{</span>D+1<span style="color: #ff1493;">}</span> <span style="color: #ff1493;">{</span>D+2<span style="color: #ff1493;">}</span> <span style="color: #ff1493;">{</span>D+3<span style="color: #ff1493;">}</span><span style="color: #ff8c00;">)</span>   <span style="color: #7F9F7F;">; (1 2 3)</span>


<span style="color: #ff8c00;">(</span><span style="color: #DCDCCC; font-weight: bold;">define</span> f <span style="color: #DCDCCC; font-weight: bold;">as</span> <span style="color: #ff1493;">(</span><span style="color: #DCDCCC; font-weight: bold;">fn</span> <span style="color: #7fff00;">(</span>x y ...<span style="color: #7fff00;">)</span> <span style="color: #7fff00;">(</span><span style="color: #DCDCCC; font-weight: bold;">println</span> x<span style="color: #7fff00;">)</span> <span style="color: #7fff00;">(</span><span style="color: #DCDCCC; font-weight: bold;">println</span> y<span style="color: #7fff00;">)</span><span style="color: #ff1493;">)</span>
    <span style="color: #CC9393;">[f]</span> '<span style="color: #ff1493;">(</span>x <span style="color: #CC9393;">[x]</span> y <span style="color: #CC9393;">[rest of the args]</span> ... <span style="color: #CC9393;">[varargs]</span><span style="color: #ff1493;">)</span>
    <span style="color: #DCDCCC; font-weight: bold;">howto-no</span><span style="color: #ff8c00;">)</span>

<span style="color: #ff8c00;">(</span>f <span style="color: #ff1493;">{</span>D+1<span style="color: #ff1493;">}</span> <span style="color: #ff1493;">{</span>D+2<span style="color: #ff1493;">}</span> <span style="color: #ff1493;">{</span>D+3<span style="color: #ff1493;">}</span><span style="color: #ff8c00;">)</span>   <span style="color: #7F9F7F;">; Prints 1|newline|(2 3)</span>
</pre>
</div>
</div>
</div>
