dev/doc/book/dern-manual.org
** Getting help with =howto=

Function =howto= can be used for asking howto do something. It is given first the arguments and then the expected result. It returns a vector containing
a listing of forms to do the task. Not all functions support =howto=, but many do. Usually functions supporting =howto= should not have (large) side effects.
When writing Dern functions, one has to decide whether those functions should support =howto= or not.

Here is small example:

#+BEGIN_SRC octaspire-dern
; Enter these forms into the REPL
(howto {D+1} {D+2} {D+3})
; ((+ {D+1} {D+2}) (+ {D+2} {D+1}))

(howto [a] [b] [ab]) ; ((+ [a] [b]))

(howto '(John Mike Alice Lola) 0 'John)
; ((ln@ (quote (John Mike Alice Lola)) {D+0})
;  (cp@ (quote (John Mike Alice Lola)) {D+0}))

(howto '(John Mike Alice Lola) 'Lola '({D+3}))
; ((find (quote (John Mike Alice Lola)) (quote Lola)))


; Or print them
(println (howto {D+1} {D+2} {D+3}))
; prints ((+ {D+1} {D+2}) (+ {D+2} {D+1}))

(println (howto [a] [b] [ab])) ; prints ((+ [a] [b]))

(println (howto '(John Mike Alice Lola) 0 'John))
; prints ((ln@ (quote (John Mike Alice Lola)) {D+0})
;         (cp@ (quote (John Mike Alice Lola)) {D+0}))

(println (howto '(John Mike Alice Lola) 'Lola
                '({D+3})))
; prints ((find (quote (John Mike Alice Lola))
;               (quote Lola)))
#+END_SRC

** Returning from functions early

The value of the last expression of function is usually the return value from that function.
However, by using =return= one can return early and have multiple exit points from a function.
Small example:

#+BEGIN_SRC octaspire-dern
(define errorCode as {D+1} [0 means no error.])

(define start-engine as (fn ()
    (if (!= errorCode {D+0}) (return [Cannot start]))
    ; .... Start the engine here...
    [Start engine if all OK] '() howto-no))
#+END_SRC

Function =return= can be called with zero or one argument. If no arguments are given, then =return=
will return the value =nil=. Short example:

#+BEGIN_SRC octaspire-dern
((fn () (return nil)))   ; Evaluates into 'nil'.
((fn () (return)))       ; Evaluates into 'nil'.
#+END_SRC

** Evaluating values

Special =eval= can be used to evaluate a given value. It can be called with one or two arguments.
The second argument, if present, must be an environment that is used while evaluating. If no
environment is given, the global environment is used instead.

Function =eval= is useful, for example, in situations where you build the name of the function to be
called at runtime. Small example:

#+BEGIN_SRC octaspire-dern
(define level-next as (fn ()
    (level-reset)

    (define lnum as (+ level-current-number {D+1})
        [level number])

    (if (> lnum number-of-levels) (= lnum {D+1}))

    (define name-of-fn-to-call as 'level-
        [name of the level builder function to call])
    (+= name-of-fn-to-call lnum)
    (eval ((eval name-of-fn-to-call)))) [next level]
        '() howto-no)
#+END_SRC

