release/documentation/dern-manual.html

<div id="outline-container-org881198a" class="outline-2">
<h2 id="org881198a"><span class="section-number-2">16</span> Environments</h2>
<div class="outline-text-2" id="text-16">
<p>
Here are few examples:
</p>

<div class="org-src-container">
<pre class="src src-octaspire-dern"><span style="color: #ff8c00;">(</span><span style="color: #DCDCCC; font-weight: bold;">env-global</span><span style="color: #ff8c00;">)</span>
<span style="color: #ff8c00;">(</span><span style="color: #DCDCCC; font-weight: bold;">env-current</span><span style="color: #ff8c00;">)</span>
<span style="color: #ff8c00;">(</span><span style="color: #DCDCCC; font-weight: bold;">env-new</span><span style="color: #ff8c00;">)</span>
</pre>
</div>
</div>
</div>

<div id="outline-container-orgf6abdb6" class="outline-2">
<h2 id="orgf6abdb6"><span class="section-number-2">17</span> Getting help with <code>howto</code></h2>
<div class="outline-text-2" id="text-17">
<p>
Function <code>howto</code> can be used for asking howto do something. It is given first the arguments and then the expected result. It returns a vector containing
a listing of forms to do the task. Not all functions support <code>howto</code>, but many do. Usually functions supporting <code>howto</code> should not have (large) side effects.
When writing Dern functions, one has to decide whether those functions should support <code>howto</code> or not.
</p>

<p>
Here is small example:
</p>

<div class="org-src-container">
<pre class="src src-octaspire-dern"><span style="color: #7F9F7F;">; Enter these forms into the REPL</span>
<span style="color: #ff8c00;">(</span><span style="color: #DCDCCC; font-weight: bold;">howto</span> <span style="color: #ff1493;">{</span>D+1<span style="color: #ff1493;">}</span> <span style="color: #ff1493;">{</span>D+2<span style="color: #ff1493;">}</span> <span style="color: #ff1493;">{</span>D+3<span style="color: #ff1493;">}</span><span style="color: #ff8c00;">)</span>
<span style="color: #7F9F7F;">; ((+ {D+1} {D+2}) (+ {D+2} {D+1}))</span>

<span style="color: #ff8c00;">(</span><span style="color: #DCDCCC; font-weight: bold;">howto</span> <span style="color: #CC9393;">[a]</span> <span style="color: #CC9393;">[b]</span> <span style="color: #CC9393;">[ab]</span><span style="color: #ff8c00;">)</span> <span style="color: #7F9F7F;">; ((+ [a] [b]))</span>

<span style="color: #ff8c00;">(</span><span style="color: #DCDCCC; font-weight: bold;">howto</span> '<span style="color: #ff1493;">(</span>John Mike Alice Lola<span style="color: #ff1493;">)</span> 0 'John<span style="color: #ff8c00;">)</span>
<span style="color: #7F9F7F;">; ((ln@ (quote (John Mike Alice Lola)) {D+0})</span>
<span style="color: #7F9F7F;">;  (cp@ (quote (John Mike Alice Lola)) {D+0}))</span>

<span style="color: #ff8c00;">(</span><span style="color: #DCDCCC; font-weight: bold;">howto</span> '<span style="color: #ff1493;">(</span>John Mike Alice Lola<span style="color: #ff1493;">)</span> 'Lola '<span style="color: #ff1493;">(</span><span style="color: #7fff00;">{</span>D+3<span style="color: #7fff00;">}</span><span style="color: #ff1493;">)</span><span style="color: #ff8c00;">)</span>
<span style="color: #7F9F7F;">; ((find (quote (John Mike Alice Lola)) (quote Lola)))</span>


<span style="color: #7F9F7F;">; Or print them</span>
<span style="color: #ff8c00;">(</span><span style="color: #DCDCCC; font-weight: bold;">println</span> <span style="color: #ff1493;">(</span><span style="color: #DCDCCC; font-weight: bold;">howto</span> <span style="color: #7fff00;">{</span>D+1<span style="color: #7fff00;">}</span> <span style="color: #7fff00;">{</span>D+2<span style="color: #7fff00;">}</span> <span style="color: #7fff00;">{</span>D+3<span style="color: #7fff00;">}</span><span style="color: #ff1493;">)</span><span style="color: #ff8c00;">)</span>
<span style="color: #7F9F7F;">; prints ((+ {D+1} {D+2}) (+ {D+2} {D+1}))</span>

<span style="color: #ff8c00;">(</span><span style="color: #DCDCCC; font-weight: bold;">println</span> <span style="color: #ff1493;">(</span><span style="color: #DCDCCC; font-weight: bold;">howto</span> <span style="color: #CC9393;">[a]</span> <span style="color: #CC9393;">[b]</span> <span style="color: #CC9393;">[ab]</span><span style="color: #ff1493;">)</span><span style="color: #ff8c00;">)</span> <span style="color: #7F9F7F;">; prints ((+ [a] [b]))</span>

<span style="color: #ff8c00;">(</span><span style="color: #DCDCCC; font-weight: bold;">println</span> <span style="color: #ff1493;">(</span><span style="color: #DCDCCC; font-weight: bold;">howto</span> '<span style="color: #7fff00;">(</span>John Mike Alice Lola<span style="color: #7fff00;">)</span> 0 'John<span style="color: #ff1493;">)</span><span style="color: #ff8c00;">)</span>
<span style="color: #7F9F7F;">; prints ((ln@ (quote (John Mike Alice Lola)) {D+0})</span>
<span style="color: #7F9F7F;">;         (cp@ (quote (John Mike Alice Lola)) {D+0}))</span>

<span style="color: #ff8c00;">(</span><span style="color: #DCDCCC; font-weight: bold;">println</span> <span style="color: #ff1493;">(</span><span style="color: #DCDCCC; font-weight: bold;">howto</span> '<span style="color: #7fff00;">(</span>John Mike Alice Lola<span style="color: #7fff00;">)</span> 'Lola
                '<span style="color: #7fff00;">(</span><span style="color: #00bfff;">{</span>D+3<span style="color: #00bfff;">}</span><span style="color: #7fff00;">)</span><span style="color: #ff1493;">)</span><span style="color: #ff8c00;">)</span>
<span style="color: #7F9F7F;">; prints ((find (quote (John Mike Alice Lola))</span>
<span style="color: #7F9F7F;">;               (quote Lola)))</span>
</pre>
</div>
</div>
</div>

<div id="outline-container-orgba5ca35" class="outline-2">
<h2 id="orgba5ca35"><span class="section-number-2">18</span> Returning from functions early</h2>
<div class="outline-text-2" id="text-18">
<p>
The value of the last expression of function is usually the return value from that function.
However, by using <code>return</code> one can return early and have multiple exit points from a function.
Small example:
</p>

<div class="org-src-container">
<pre class="src src-octaspire-dern"><span style="color: #ff8c00;">(</span><span style="color: #DCDCCC; font-weight: bold;">define</span> errorCode <span style="color: #DCDCCC; font-weight: bold;">as</span> <span style="color: #ff1493;">{</span>D+1<span style="color: #ff1493;">}</span> <span style="color: #CC9393;">[0 means no error.]</span><span style="color: #ff8c00;">)</span>

<span style="color: #ff8c00;">(</span><span style="color: #DCDCCC; font-weight: bold;">define</span> start-engine <span style="color: #DCDCCC; font-weight: bold;">as</span> <span style="color: #ff1493;">(</span><span style="color: #DCDCCC; font-weight: bold;">fn</span> <span style="color: #7fff00;">()</span>
    <span style="color: #7fff00;">(</span><span style="color: #DCDCCC; font-weight: bold;">if</span> <span style="color: #00bfff;">(</span>!<span style="color: #DCDCCC; font-weight: bold;">=</span> errorCode <span style="color: #ffff00;">{</span>D+0<span style="color: #ffff00;">}</span><span style="color: #00bfff;">)</span> <span style="color: #00bfff;">(</span><span style="color: #DCDCCC; font-weight: bold;">return</span> <span style="color: #CC9393;">[Cannot start]</span><span style="color: #00bfff;">)</span><span style="color: #7fff00;">)</span>
    <span style="color: #7F9F7F;">; .... Start the engine here...</span>
    <span style="color: #CC9393;">[Start engine if all OK]</span> '<span style="color: #7fff00;">()</span> <span style="color: #DCDCCC; font-weight: bold;">howto-no</span><span style="color: #ff1493;">)</span><span style="color: #ff8c00;">)</span>
</pre>
</div>

<p>
Function <code>return</code> can be called with zero or one argument. If no arguments are given, then <code>return</code>
will return the value <code>nil</code>. Short example:
</p>

<div class="org-src-container">
<pre class="src src-octaspire-dern"><span style="color: #ff8c00;">(</span><span style="color: #ff1493;">(</span><span style="color: #DCDCCC; font-weight: bold;">fn</span> <span style="color: #7fff00;">()</span> <span style="color: #7fff00;">(</span><span style="color: #DCDCCC; font-weight: bold;">return</span> <span style="color: #BFEBBF;">nil</span><span style="color: #7fff00;">)</span><span style="color: #ff1493;">)</span><span style="color: #ff8c00;">)</span>   <span style="color: #7F9F7F;">; Evaluates into 'nil'.</span>
<span style="color: #ff8c00;">(</span><span style="color: #ff1493;">(</span><span style="color: #DCDCCC; font-weight: bold;">fn</span> <span style="color: #7fff00;">()</span> <span style="color: #7fff00;">(</span><span style="color: #DCDCCC; font-weight: bold;">return</span><span style="color: #7fff00;">)</span><span style="color: #ff1493;">)</span><span style="color: #ff8c00;">)</span>       <span style="color: #7F9F7F;">; Evaluates into 'nil'.</span>
</pre>
</div>
</div>
</div>

<div id="outline-container-orgd6706ef" class="outline-2">
<h2 id="orgd6706ef"><span class="section-number-2">19</span> Evaluating values</h2>
<div class="outline-text-2" id="text-19">
<p>
Special <code>eval</code> can be used to evaluate a given value. It can be called with one or two arguments.
The second argument, if present, must be an environment that is used while evaluating. If no
environment is given, the global environment is used instead.
</p>

<p>
Function <code>eval</code> is useful, for example, in situations where you build the name of the function to be
called at runtime. Small example:
</p>

<div class="org-src-container">
<pre class="src src-octaspire-dern"><span style="color: #ff8c00;">(</span><span style="color: #DCDCCC; font-weight: bold;">define</span> level-next <span style="color: #DCDCCC; font-weight: bold;">as</span> <span style="color: #ff1493;">(</span><span style="color: #DCDCCC; font-weight: bold;">fn</span> <span style="color: #7fff00;">()</span>
    <span style="color: #7fff00;">(</span>level-reset<span style="color: #7fff00;">)</span>

    <span style="color: #7fff00;">(</span><span style="color: #DCDCCC; font-weight: bold;">define</span> lnum <span style="color: #DCDCCC; font-weight: bold;">as</span> <span style="color: #00bfff;">(</span><span style="color: #DCDCCC; font-weight: bold;">+</span> level-current-number <span style="color: #ffff00;">{</span>D+1<span style="color: #ffff00;">}</span><span style="color: #00bfff;">)</span>
        <span style="color: #CC9393;">[level number]</span><span style="color: #7fff00;">)</span>

    <span style="color: #7fff00;">(</span><span style="color: #DCDCCC; font-weight: bold;">if</span> <span style="color: #00bfff;">(</span><span style="color: #DCDCCC; font-weight: bold;">&gt;</span> lnum number-of-levels<span style="color: #00bfff;">)</span> <span style="color: #00bfff;">(</span><span style="color: #DCDCCC; font-weight: bold;">=</span> lnum <span style="color: #ffff00;">{</span>D+1<span style="color: #ffff00;">}</span><span style="color: #00bfff;">)</span><span style="color: #7fff00;">)</span>

    <span style="color: #7fff00;">(</span><span style="color: #DCDCCC; font-weight: bold;">define</span> name-of-fn-to-call <span style="color: #DCDCCC; font-weight: bold;">as</span> 'level-
        <span style="color: #CC9393;">[name of the level builder function to call]</span><span style="color: #7fff00;">)</span>
    <span style="color: #7fff00;">(</span><span style="color: #DCDCCC; font-weight: bold;">+=</span> name-of-fn-to-call lnum<span style="color: #7fff00;">)</span>
    <span style="color: #7fff00;">(</span><span style="color: #DCDCCC; font-weight: bold;">eval</span> <span style="color: #00bfff;">(</span><span style="color: #ffff00;">(</span><span style="color: #DCDCCC; font-weight: bold;">eval</span> name-of-fn-to-call<span style="color: #ffff00;">)</span><span style="color: #00bfff;">)</span><span style="color: #7fff00;">)</span><span style="color: #ff1493;">)</span> <span style="color: #CC9393;">[next level]</span>
        '<span style="color: #ff1493;">()</span> <span style="color: #DCDCCC; font-weight: bold;">howto-no</span><span style="color: #ff8c00;">)</span>
</pre>
</div>
</div>
</div>
