dev/doc/book/dern-manual.org
** Input and output ports

Input and output can be done through ports. Ports can be created and attached to different
sources and sinks of data (for example the file system).

Here is small example:

#+BEGIN_SRC octaspire-dern
(define f as (io-file-open [/path/goes/here.xy]) [f])

(port-read f)
(port-read f {D+3})

(port-write f {D+65})
(port-write f '({D+65} {D+66} {D+67}))
#+END_SRC

Ports can be explicitly closed, but it is not required; port will close automatically when the
garbage collector collects it. Some ports might also support *seeking*, *distance measurement*,
*length measurement* and *flushing*. Here is another small example:

#+BEGIN_SRC octaspire-dern
(define f as (io-file-open [/path/goes/here.xy]) [f])

(port-seek f {D-1}) ; Seek to the end
(port-write f {D+65})

(port-seek f {D+0})  ; Seek to the beginning
(port-write f {D+65})

(port-seek f {D-2}) ; Seek to one octet from the end
(port-write f {D+66})

(port-seek f {D+1})
; Seek to one octet from the beginning

(port-write f {D+65})

; Seek one octet forward  from the current position
(port-seek f  {D+1} 'from-current)

; Seek one octet backward from the current position
(port-seek f {D-1} 'from-current)

; Tell the distance (in octets) from
; the beginning of the port
(port-dist f)

(port-length f)
; Tell the size (in octets) of the port

; Buffer is flushed to disk.
; Happens also automatically on close.
(port-flush f)
; Close port. This happens also automatically.
(port-close f)

(port-length f) ; -1
#+END_SRC

Input ports can be iterated with =for= in similar way that containers are iterated:

#+BEGIN_SRC octaspire-dern
(define f as (io-file-open [/path/goes/here.xy]) [f])

(for i in f (println i)) ; Print every octet

(port-seek f {D+0})      ; Seek to the beginning

; Print every other octet
(for i in f step {D+2} (println i))

(port-seek f {D+0}) ; Seek to the beginning

; Print every third octet
(for i in f step {D+3} (println i))
#+END_SRC

=io-file-open= will open a file for reading and writing, =input-file-open= will open a file
only for reading and =output-file-open= will open file only for writing.

Below is short example about querying a port for supported operations:

#+BEGIN_SRC octaspire-dern
(define f as (io-file-open [/path/goes/here.xy]) [f])

(port-supports-output? f)          ; true
(port-supports-input?  f)          ; true

(define f as
    (output-file-open [/path/goes/here.xy]) [f])

(port-supports-output? f)          ; true
(port-supports-input?  f)          ; false

(define f as
    (input-file-open [/path/goes/here.xy]) [f])

(port-supports-output? f)          ; false
(port-supports-input?  f)          ; true
#+END_SRC

You can use =port-write= and ~+=~ to write to a port octets with values =integer=, =character=,
=string= and =vector= of these types. Example:

#+BEGIN_SRC octaspire-dern
(define f as (io-file-open [/path/goes/here.xy]) [f])

(+= f |a| |b| [ cat] |!|)  ; ab cat!

(port-write f '({D+65} |A| [ Hi!])) ; AA Hi!
#+END_SRC

