release/documentation/dern-manual.html

<div id="outline-container-org6b15543" class="outline-2">
<h2 id="org6b15543"><span class="section-number-2">20</span> Input and output ports</h2>
<div class="outline-text-2" id="text-20">
<p>
Input and output can be done through ports. Ports can be created and attached to different
sources and sinks of data (for example the file system).
</p>

<p>
Here is small example:
</p>

<div class="org-src-container">
<pre class="src src-octaspire-dern"><span style="color: #ff8c00;">(</span><span style="color: #DCDCCC; font-weight: bold;">define</span> f <span style="color: #DCDCCC; font-weight: bold;">as</span> <span style="color: #ff1493;">(</span><span style="color: #DCDCCC; font-weight: bold;">io-file-open</span> <span style="color: #CC9393;">[/path/goes/here.xy]</span><span style="color: #ff1493;">)</span> <span style="color: #CC9393;">[f]</span><span style="color: #ff8c00;">)</span>

<span style="color: #ff8c00;">(</span><span style="color: #DCDCCC; font-weight: bold;">port-read</span> f<span style="color: #ff8c00;">)</span>
<span style="color: #ff8c00;">(</span><span style="color: #DCDCCC; font-weight: bold;">port-read</span> f <span style="color: #ff1493;">{</span>D+3<span style="color: #ff1493;">}</span><span style="color: #ff8c00;">)</span>

<span style="color: #ff8c00;">(</span><span style="color: #DCDCCC; font-weight: bold;">port-write</span> f <span style="color: #ff1493;">{</span>D+65<span style="color: #ff1493;">}</span><span style="color: #ff8c00;">)</span>
<span style="color: #ff8c00;">(</span><span style="color: #DCDCCC; font-weight: bold;">port-write</span> f '<span style="color: #ff1493;">(</span><span style="color: #7fff00;">{</span>D+65<span style="color: #7fff00;">}</span> <span style="color: #7fff00;">{</span>D+66<span style="color: #7fff00;">}</span> <span style="color: #7fff00;">{</span>D+67<span style="color: #7fff00;">}</span><span style="color: #ff1493;">)</span><span style="color: #ff8c00;">)</span>
</pre>
</div>

<p>
Ports can be explicitly closed, but it is not required; port will close automatically when the
garbage collector collects it. Some ports might also support <b>seeking</b>, <b>distance measurement</b>,
<b>length measurement</b> and <b>flushing</b>. Here is another small example:
</p>

<div class="org-src-container">
<pre class="src src-octaspire-dern"><span style="color: #ff8c00;">(</span><span style="color: #DCDCCC; font-weight: bold;">define</span> f <span style="color: #DCDCCC; font-weight: bold;">as</span> <span style="color: #ff1493;">(</span><span style="color: #DCDCCC; font-weight: bold;">io-file-open</span> <span style="color: #CC9393;">[/path/goes/here.xy]</span><span style="color: #ff1493;">)</span> <span style="color: #CC9393;">[f]</span><span style="color: #ff8c00;">)</span>

<span style="color: #ff8c00;">(</span><span style="color: #DCDCCC; font-weight: bold;">port-seek</span> f <span style="color: #ff1493;">{</span>D-1<span style="color: #ff1493;">}</span><span style="color: #ff8c00;">)</span> <span style="color: #7F9F7F;">; Seek to the end</span>
<span style="color: #ff8c00;">(</span><span style="color: #DCDCCC; font-weight: bold;">port-write</span> f <span style="color: #ff1493;">{</span>D+65<span style="color: #ff1493;">}</span><span style="color: #ff8c00;">)</span>

<span style="color: #ff8c00;">(</span><span style="color: #DCDCCC; font-weight: bold;">port-seek</span> f <span style="color: #ff1493;">{</span>D+0<span style="color: #ff1493;">}</span><span style="color: #ff8c00;">)</span>  <span style="color: #7F9F7F;">; Seek to the beginning</span>
<span style="color: #ff8c00;">(</span><span style="color: #DCDCCC; font-weight: bold;">port-write</span> f <span style="color: #ff1493;">{</span>D+65<span style="color: #ff1493;">}</span><span style="color: #ff8c00;">)</span>

<span style="color: #ff8c00;">(</span><span style="color: #DCDCCC; font-weight: bold;">port-seek</span> f <span style="color: #ff1493;">{</span>D-2<span style="color: #ff1493;">}</span><span style="color: #ff8c00;">)</span> <span style="color: #7F9F7F;">; Seek to one octet from the end</span>
<span style="color: #ff8c00;">(</span><span style="color: #DCDCCC; font-weight: bold;">port-write</span> f <span style="color: #ff1493;">{</span>D+66<span style="color: #ff1493;">}</span><span style="color: #ff8c00;">)</span>

<span style="color: #ff8c00;">(</span><span style="color: #DCDCCC; font-weight: bold;">port-seek</span> f <span style="color: #ff1493;">{</span>D+1<span style="color: #ff1493;">}</span><span style="color: #ff8c00;">)</span>
<span style="color: #7F9F7F;">; Seek to one octet from the beginning</span>

<span style="color: #ff8c00;">(</span><span style="color: #DCDCCC; font-weight: bold;">port-write</span> f <span style="color: #ff1493;">{</span>D+65<span style="color: #ff1493;">}</span><span style="color: #ff8c00;">)</span>

<span style="color: #7F9F7F;">; Seek one octet forward  from the current position</span>
<span style="color: #ff8c00;">(</span><span style="color: #DCDCCC; font-weight: bold;">port-seek</span> f  <span style="color: #ff1493;">{</span>D+1<span style="color: #ff1493;">}</span> 'from-current<span style="color: #ff8c00;">)</span>

<span style="color: #7F9F7F;">; Seek one octet backward from the current position</span>
<span style="color: #ff8c00;">(</span><span style="color: #DCDCCC; font-weight: bold;">port-seek</span> f <span style="color: #ff1493;">{</span>D-1<span style="color: #ff1493;">}</span> 'from-current<span style="color: #ff8c00;">)</span>

<span style="color: #7F9F7F;">; Tell the distance (in octets) from</span>
<span style="color: #7F9F7F;">; the beginning of the port</span>
<span style="color: #ff8c00;">(</span><span style="color: #DCDCCC; font-weight: bold;">port-dist</span> f<span style="color: #ff8c00;">)</span>

<span style="color: #ff8c00;">(</span><span style="color: #DCDCCC; font-weight: bold;">port-length</span> f<span style="color: #ff8c00;">)</span>
<span style="color: #7F9F7F;">; Tell the size (in octets) of the port</span>

<span style="color: #7F9F7F;">; Buffer is flushed to disk.</span>
<span style="color: #7F9F7F;">; Happens also automatically on close.</span>
<span style="color: #ff8c00;">(</span><span style="color: #DCDCCC; font-weight: bold;">port-flush</span> f<span style="color: #ff8c00;">)</span>
<span style="color: #7F9F7F;">; Close port. This happens also automatically.</span>
<span style="color: #ff8c00;">(</span><span style="color: #DCDCCC; font-weight: bold;">port-close</span> f<span style="color: #ff8c00;">)</span>

<span style="color: #ff8c00;">(</span><span style="color: #DCDCCC; font-weight: bold;">port-length</span> f<span style="color: #ff8c00;">)</span> <span style="color: #7F9F7F;">; -1</span>
</pre>
</div>

<p>
Input ports can be iterated with <code>for</code> in similar way that containers are iterated:
</p>

<div class="org-src-container">
<pre class="src src-octaspire-dern"><span style="color: #ff8c00;">(</span><span style="color: #DCDCCC; font-weight: bold;">define</span> f <span style="color: #DCDCCC; font-weight: bold;">as</span> <span style="color: #ff1493;">(</span><span style="color: #DCDCCC; font-weight: bold;">io-file-open</span> <span style="color: #CC9393;">[/path/goes/here.xy]</span><span style="color: #ff1493;">)</span> <span style="color: #CC9393;">[f]</span><span style="color: #ff8c00;">)</span>

<span style="color: #ff8c00;">(</span><span style="color: #DCDCCC; font-weight: bold;">for</span> i <span style="color: #DCDCCC; font-weight: bold;">in</span> f <span style="color: #ff1493;">(</span><span style="color: #DCDCCC; font-weight: bold;">println</span> i<span style="color: #ff1493;">)</span><span style="color: #ff8c00;">)</span> <span style="color: #7F9F7F;">; Print every octet</span>

<span style="color: #ff8c00;">(</span><span style="color: #DCDCCC; font-weight: bold;">port-seek</span> f <span style="color: #ff1493;">{</span>D+0<span style="color: #ff1493;">}</span><span style="color: #ff8c00;">)</span>      <span style="color: #7F9F7F;">; Seek to the beginning</span>

<span style="color: #7F9F7F;">; Print every other octet</span>
<span style="color: #ff8c00;">(</span><span style="color: #DCDCCC; font-weight: bold;">for</span> i <span style="color: #DCDCCC; font-weight: bold;">in</span> f step <span style="color: #ff1493;">{</span>D+2<span style="color: #ff1493;">}</span> <span style="color: #ff1493;">(</span><span style="color: #DCDCCC; font-weight: bold;">println</span> i<span style="color: #ff1493;">)</span><span style="color: #ff8c00;">)</span>

<span style="color: #ff8c00;">(</span><span style="color: #DCDCCC; font-weight: bold;">port-seek</span> f <span style="color: #ff1493;">{</span>D+0<span style="color: #ff1493;">}</span><span style="color: #ff8c00;">)</span> <span style="color: #7F9F7F;">; Seek to the beginning</span>

<span style="color: #7F9F7F;">; Print every third octet</span>
<span style="color: #ff8c00;">(</span><span style="color: #DCDCCC; font-weight: bold;">for</span> i <span style="color: #DCDCCC; font-weight: bold;">in</span> f step <span style="color: #ff1493;">{</span>D+3<span style="color: #ff1493;">}</span> <span style="color: #ff1493;">(</span><span style="color: #DCDCCC; font-weight: bold;">println</span> i<span style="color: #ff1493;">)</span><span style="color: #ff8c00;">)</span>
</pre>
</div>

<p>
<code>io-file-open</code> will open a file for reading and writing, <code>input-file-open</code> will open a file
only for reading and <code>output-file-open</code> will open file only for writing.
</p>

<p>
Below is short example about querying a port for supported operations:
</p>

<div class="org-src-container">
<pre class="src src-octaspire-dern"><span style="color: #ff8c00;">(</span><span style="color: #DCDCCC; font-weight: bold;">define</span> f <span style="color: #DCDCCC; font-weight: bold;">as</span> <span style="color: #ff1493;">(</span><span style="color: #DCDCCC; font-weight: bold;">io-file-open</span> <span style="color: #CC9393;">[/path/goes/here.xy]</span><span style="color: #ff1493;">)</span> <span style="color: #CC9393;">[f]</span><span style="color: #ff8c00;">)</span>

<span style="color: #ff8c00;">(</span><span style="color: #DCDCCC; font-weight: bold;">port-supports-output?</span> f<span style="color: #ff8c00;">)</span>          <span style="color: #7F9F7F;">; true</span>
<span style="color: #ff8c00;">(</span><span style="color: #DCDCCC; font-weight: bold;">port-supports-input?</span>  f<span style="color: #ff8c00;">)</span>          <span style="color: #7F9F7F;">; true</span>

<span style="color: #ff8c00;">(</span><span style="color: #DCDCCC; font-weight: bold;">define</span> f <span style="color: #DCDCCC; font-weight: bold;">as</span>
    <span style="color: #ff1493;">(</span><span style="color: #DCDCCC; font-weight: bold;">output-file-open</span> <span style="color: #CC9393;">[/path/goes/here.xy]</span><span style="color: #ff1493;">)</span> <span style="color: #CC9393;">[f]</span><span style="color: #ff8c00;">)</span>

<span style="color: #ff8c00;">(</span><span style="color: #DCDCCC; font-weight: bold;">port-supports-output?</span> f<span style="color: #ff8c00;">)</span>          <span style="color: #7F9F7F;">; true</span>
<span style="color: #ff8c00;">(</span><span style="color: #DCDCCC; font-weight: bold;">port-supports-input?</span>  f<span style="color: #ff8c00;">)</span>          <span style="color: #7F9F7F;">; false</span>

<span style="color: #ff8c00;">(</span><span style="color: #DCDCCC; font-weight: bold;">define</span> f <span style="color: #DCDCCC; font-weight: bold;">as</span>
    <span style="color: #ff1493;">(</span><span style="color: #DCDCCC; font-weight: bold;">input-file-open</span> <span style="color: #CC9393;">[/path/goes/here.xy]</span><span style="color: #ff1493;">)</span> <span style="color: #CC9393;">[f]</span><span style="color: #ff8c00;">)</span>

<span style="color: #ff8c00;">(</span><span style="color: #DCDCCC; font-weight: bold;">port-supports-output?</span> f<span style="color: #ff8c00;">)</span>          <span style="color: #7F9F7F;">; false</span>
<span style="color: #ff8c00;">(</span><span style="color: #DCDCCC; font-weight: bold;">port-supports-input?</span>  f<span style="color: #ff8c00;">)</span>          <span style="color: #7F9F7F;">; true</span>
</pre>
</div>

<p>
You can use <code>port-write</code> and <code>+=</code> to write to a port octets with values <code>integer</code>, <code>character</code>,
<code>string</code> and <code>vector</code> of these types. Example:
</p>

<div class="org-src-container">
<pre class="src src-octaspire-dern"><span style="color: #ff8c00;">(</span><span style="color: #DCDCCC; font-weight: bold;">define</span> f <span style="color: #DCDCCC; font-weight: bold;">as</span> <span style="color: #ff1493;">(</span><span style="color: #DCDCCC; font-weight: bold;">io-file-open</span> <span style="color: #CC9393;">[/path/goes/here.xy]</span><span style="color: #ff1493;">)</span> <span style="color: #CC9393;">[f]</span><span style="color: #ff8c00;">)</span>

<span style="color: #ff8c00;">(</span><span style="color: #DCDCCC; font-weight: bold;">+=</span> f <span style="color: #CC9393;">|a|</span> <span style="color: #CC9393;">|b|</span> <span style="color: #CC9393;">[ cat]</span> <span style="color: #CC9393;">|!|</span><span style="color: #ff8c00;">)</span>  <span style="color: #7F9F7F;">; ab cat!</span>

<span style="color: #ff8c00;">(</span><span style="color: #DCDCCC; font-weight: bold;">port-write</span> f '<span style="color: #ff1493;">(</span><span style="color: #7fff00;">{</span>D+65<span style="color: #7fff00;">}</span> <span style="color: #CC9393;">|A|</span> <span style="color: #CC9393;">[ Hi!]</span><span style="color: #ff1493;">)</span><span style="color: #ff8c00;">)</span> <span style="color: #7F9F7F;">; AA Hi!</span>
</pre>
</div>
</div>
</div>
