release/documentation/dern-manual.html

<div id="outline-container-org0a8528a" class="outline-2">
<h2 id="org0a8528a"><span class="section-number-2">21</span> Converting between types</h2>
<div class="outline-text-2" id="text-21">
<p>
TODO
</p>
</div>
</div>

<div id="outline-container-org123d3e5" class="outline-2">
<h2 id="org123d3e5"><span class="section-number-2">22</span> Searching and indexing</h2>
<div class="outline-text-2" id="text-22">
<div class="org-src-container">
<pre class="src src-octaspire-dern"><span style="color: #ff8c00;">(</span><span style="color: #DCDCCC; font-weight: bold;">define</span> names <span style="color: #DCDCCC; font-weight: bold;">as</span> '<span style="color: #ff1493;">(</span>Mike John Lola Alice Lola<span style="color: #ff1493;">)</span> <span style="color: #CC9393;">[names]</span><span style="color: #ff8c00;">)</span>

<span style="color: #ff8c00;">(</span><span style="color: #DCDCCC; font-weight: bold;">println</span> <span style="color: #ff1493;">(</span><span style="color: #DCDCCC; font-weight: bold;">find</span> names 'Mike<span style="color: #ff1493;">)</span><span style="color: #ff8c00;">)</span>  <span style="color: #7F9F7F;">; prints ({D+0})</span>
<span style="color: #ff8c00;">(</span><span style="color: #DCDCCC; font-weight: bold;">println</span> <span style="color: #ff1493;">(</span><span style="color: #DCDCCC; font-weight: bold;">find</span> names 'John<span style="color: #ff1493;">)</span><span style="color: #ff8c00;">)</span>  <span style="color: #7F9F7F;">; prints ({D+1})</span>
<span style="color: #ff8c00;">(</span><span style="color: #DCDCCC; font-weight: bold;">println</span> <span style="color: #ff1493;">(</span><span style="color: #DCDCCC; font-weight: bold;">find</span> names 'Lola<span style="color: #ff1493;">)</span><span style="color: #ff8c00;">)</span>  <span style="color: #7F9F7F;">; prints ({D+2} {D+4})</span>

 <span style="color: #7F9F7F;">; prints (({D+0}) ({D+1}) ({D+2} {D+4}))</span>
<span style="color: #ff8c00;">(</span><span style="color: #DCDCCC; font-weight: bold;">println</span> <span style="color: #ff1493;">(</span><span style="color: #DCDCCC; font-weight: bold;">find</span> names 'Mike 'John 'Lola<span style="color: #ff1493;">)</span><span style="color: #ff8c00;">)</span>


<span style="color: #ff8c00;">(</span><span style="color: #DCDCCC; font-weight: bold;">define</span> rooms <span style="color: #DCDCCC; font-weight: bold;">as</span> <span style="color: #ff1493;">(</span><span style="color: #DCDCCC; font-weight: bold;">hash-map</span> 'Mike <span style="color: #7fff00;">{</span>D+100<span style="color: #7fff00;">}</span>
                           'John <span style="color: #7fff00;">{</span>D+101<span style="color: #7fff00;">}</span>
                           'Lola '<span style="color: #7fff00;">(</span><span style="color: #00bfff;">{</span>D+102<span style="color: #00bfff;">}</span> <span style="color: #00bfff;">{</span>D+103<span style="color: #00bfff;">}</span><span style="color: #7fff00;">)</span>
                           'Alice <span style="color: #7fff00;">{</span>D+104<span style="color: #7fff00;">}</span><span style="color: #ff1493;">)</span>
                 <span style="color: #CC9393;">[room numbers]</span><span style="color: #ff8c00;">)</span>

<span style="color: #ff8c00;">(</span><span style="color: #DCDCCC; font-weight: bold;">println</span> <span style="color: #ff1493;">(</span><span style="color: #DCDCCC; font-weight: bold;">find</span> rooms 'Mike<span style="color: #ff1493;">)</span><span style="color: #ff8c00;">)</span> <span style="color: #7F9F7F;">; prints {D+100}</span>

<span style="color: #ff8c00;">(</span><span style="color: #DCDCCC; font-weight: bold;">println</span> <span style="color: #ff1493;">(</span><span style="color: #DCDCCC; font-weight: bold;">find</span> rooms 'Lola<span style="color: #ff1493;">)</span><span style="color: #ff8c00;">)</span>
<span style="color: #7F9F7F;">; prints ({D+102} {D+103})</span>

<span style="color: #ff8c00;">(</span><span style="color: #DCDCCC; font-weight: bold;">println</span> <span style="color: #ff1493;">(</span><span style="color: #DCDCCC; font-weight: bold;">find</span> rooms 'Nobody<span style="color: #ff1493;">)</span><span style="color: #ff8c00;">)</span> <span style="color: #7F9F7F;">; prints nil</span>


<span style="color: #7F9F7F;">; prints ({D+7} {D+11} {D+15})</span>
<span style="color: #ff8c00;">(</span><span style="color: #DCDCCC; font-weight: bold;">println</span> <span style="color: #ff1493;">(</span><span style="color: #DCDCCC; font-weight: bold;">find</span> <span style="color: #CC9393;">[012345 abc abc abc]</span> <span style="color: #CC9393;">[abc]</span><span style="color: #ff1493;">)</span><span style="color: #ff8c00;">)</span>
<span style="color: #ff8c00;">(</span><span style="color: #DCDCCC; font-weight: bold;">println</span> <span style="color: #ff1493;">(</span><span style="color: #DCDCCC; font-weight: bold;">find</span> <span style="color: #CC9393;">[012345]</span> <span style="color: #CC9393;">|3|</span><span style="color: #ff1493;">)</span><span style="color: #ff8c00;">)</span> <span style="color: #7F9F7F;">; prints ({D+3})</span>
</pre>
</div>

<p>
TODO
</p>
</div>
</div>
