release/documentation/dern-manual.html

<div id="outline-container-org804fbd1" class="outline-2">
<h2 id="org804fbd1"><span class="section-number-2">23</span> Loading libraries with <code>require</code></h2>
<div class="outline-text-2" id="text-23">
<p>
Dern has support for loading libraries or &ldquo;plugins&rdquo; during run time with the builtin <code>require</code>.
Before loading the requested library, <code>require</code> checks whether the library is already loaded,
and loads it only if it isn&rsquo;t already loaded.
</p>

<p>
It first tries to find a source library (.dern file) with the given name. If it finds, it loads
that. Next it tries to find a binary library (.so file in Unix) and loads that if found.
</p>

<p>
So, in the example below, <code>require</code> tries first to find file named <b>mylib.dern</b> and then,
if the system is Unix, file named <b>libmylib.so</b>.
</p>

<p>
Here is small example:
</p>

<div class="org-src-container">
<pre class="src src-octaspire-dern"><span style="color: #ff8c00;">(</span><span style="color: #DCDCCC; font-weight: bold;">require</span> 'mylib<span style="color: #ff8c00;">)</span>
<span style="color: #ff8c00;">(</span>mylib-say <span style="color: #CC9393;">[Hello world from library]</span><span style="color: #ff8c00;">)</span>
</pre>
</div>

<p>
If <code>mylib</code>-library is required later again, there is no need to search and load it again, because
<code>require</code> know that a library with that name is already loaded.
</p>

<p>
Below is a small example of a binary library for <b>Linux</b>, <b>FreeBSD</b>, <b>NetBSD</b>, <b>Haiku</b> and
<b>MINIX 3</b> systems.
</p>

<div class="org-src-container">
<pre class="src src-c"><span style="color: #5F7F5F;">/***</span>
<span style="color: #7F9F7F;">  To build this file into a shared library in Linux:</span>

<span style="color: #7F9F7F;">  gcc -c -fPIC mylib.c     \</span>
<span style="color: #7F9F7F;">      -I ../../../include  \</span>
<span style="color: #7F9F7F;">      -I ../../../external/octaspire_core/include</span>
<span style="color: #7F9F7F;">  gcc -shared -o libmylib.so mylib.o</span>
<span style="color: #7F9F7F;">***/</span>
<span style="color: #94BFF3;">#include</span> <span style="color: #ff8c00;">&lt;</span><span style="color: #CC9393;">stdio.h</span><span style="color: #ff8c00;">&gt;</span>
<span style="color: #94BFF3;">#include</span> <span style="color: #ff8c00;">&lt;</span><span style="color: #CC9393;">octaspire/core/octaspire_helpers.h</span><span style="color: #ff8c00;">&gt;</span>
<span style="color: #94BFF3;">#include</span> <span style="color: #CC9393;">"octaspire/dern/octaspire_dern_vm.h"</span>
<span style="color: #94BFF3;">#include</span> <span style="color: #CC9393;">"octaspire/dern/octaspire_dern_environment.h"</span>

<span style="color: #7CB8BB;">octaspire_dern_value_t</span> *<span style="color: #93E0E3;">mylib_say</span><span style="color: #ff8c00;">(</span>
    <span style="color: #7CB8BB;">octaspire_dern_vm_t</span> *<span style="color: #DFAF8F;">vm</span>,
    <span style="color: #7CB8BB;">octaspire_dern_value_t</span> *<span style="color: #DFAF8F;">arguments</span>,
    <span style="color: #7CB8BB;">octaspire_dern_value_t</span> *<span style="color: #DFAF8F;">environment</span><span style="color: #ff8c00;">)</span>
<span style="color: #ff8c00;">{</span>
    OCTASPIRE_HELPERS_UNUSED_PARAMETER<span style="color: #ff1493;">(</span>environment<span style="color: #ff1493;">)</span>;

    <span style="color: #F0DFAF; font-weight: bold;">if</span> <span style="color: #ff1493;">(</span>octaspire_dern_value_as_vector_get_length<span style="color: #7fff00;">(</span>
        arguments<span style="color: #7fff00;">)</span> != 1<span style="color: #ff1493;">)</span>
    <span style="color: #ff1493;">{</span>
        <span style="color: #F0DFAF; font-weight: bold;">return</span>
octaspire_dern_vm_create_new_value_error_from_c_string<span style="color: #7fff00;">(</span>
                vm,
                <span style="color: #CC9393;">"mylib-say expects one argument"</span><span style="color: #7fff00;">)</span>;
    <span style="color: #ff1493;">}</span>

    <span style="color: #7CB8BB;">octaspire_dern_value_t</span> <span style="color: #F0DFAF; font-weight: bold;">const</span> * <span style="color: #F0DFAF; font-weight: bold;">const</span> <span style="color: #DFAF8F;">messageVal</span> =
   octaspire_dern_value_as_vector_get_element_at_const<span style="color: #ff1493;">(</span>
            arguments,
            0<span style="color: #ff1493;">)</span>;

    <span style="color: #F0DFAF; font-weight: bold;">if</span> <span style="color: #ff1493;">(</span>messageVal-&gt;typeTag !=
        OCTASPIRE_DERN_VALUE_TAG_STRING<span style="color: #ff1493;">)</span>
    <span style="color: #ff1493;">{</span>
        <span style="color: #F0DFAF; font-weight: bold;">return</span>
octaspire_dern_vm_create_new_value_error_from_c_string<span style="color: #7fff00;">(</span>
                vm,
                <span style="color: #CC9393;">"mylib-say expects string argument"</span><span style="color: #7fff00;">)</span>;
    <span style="color: #ff1493;">}</span>

    printf<span style="color: #ff1493;">(</span><span style="color: #CC9393;">"%s\n"</span>,
           octaspire_dern_value_as_string_get_c_string<span style="color: #7fff00;">(</span>
               messageVal<span style="color: #7fff00;">)</span><span style="color: #ff1493;">)</span>;

    <span style="color: #F0DFAF; font-weight: bold;">return</span> octaspire_dern_vm_create_new_value_boolean<span style="color: #ff1493;">(</span>
        vm,
        <span style="color: #BFEBBF;">true</span><span style="color: #ff1493;">)</span>;
<span style="color: #ff8c00;">}</span>

<span style="color: #7CB8BB;">bool</span> <span style="color: #93E0E3;">mylib_init</span><span style="color: #ff8c00;">(</span>
    <span style="color: #7CB8BB;">octaspire_dern_vm_t</span> * <span style="color: #F0DFAF; font-weight: bold;">const</span> <span style="color: #DFAF8F;">vm</span>,
    <span style="color: #7CB8BB;">octaspire_dern_environment_t</span> * <span style="color: #F0DFAF; font-weight: bold;">const</span> <span style="color: #DFAF8F;">targetEnv</span><span style="color: #ff8c00;">)</span>
<span style="color: #ff8c00;">{</span>
    octaspire_helpers_verify<span style="color: #ff1493;">(</span>vm &amp;&amp; targetEnv<span style="color: #ff1493;">)</span>;

    <span style="color: #F0DFAF; font-weight: bold;">if</span> <span style="color: #ff1493;">(</span>
    <span style="color: #F0DFAF; font-weight: bold;">!</span>octaspire_dern_vm_create_and_register_new_builtin<span style="color: #7fff00;">(</span>
        vm,
        <span style="color: #CC9393;">"mylib-say"</span>,
        mylib_say,
        1,
        <span style="color: #CC9393;">"mylib says something"</span>,
        targetEnv<span style="color: #7fff00;">)</span><span style="color: #ff1493;">)</span>
    <span style="color: #ff1493;">{</span>
        <span style="color: #F0DFAF; font-weight: bold;">return</span> <span style="color: #BFEBBF;">false</span>;
    <span style="color: #ff1493;">}</span>

    <span style="color: #F0DFAF; font-weight: bold;">return</span> <span style="color: #BFEBBF;">true</span>;
<span style="color: #ff8c00;">}</span>
</pre>
</div>

<p>
See directory doc/examples/plugin in the source distribution for an example with Makefiles
for different systems.
</p>
</div>

<div id="outline-container-org5b9fa57" class="outline-3">
<h3 id="org5b9fa57"><span class="section-number-3">23.1</span> Building and using a binary library in Haiku</h3>
<div class="outline-text-3" id="text-23-1">
<p>
Run these commands from the <b>build</b>-directory of the source distribution:
</p>

<div class="org-src-container">
<pre class="src src-sh">make -C ../doc/examples/plugin -f Makefile.Haiku
<span style="color: #DFAF8F;">LIBRARY_PATH</span>=$<span style="color: #DFAF8F;">LIBRARY_PATH</span>:../doc/examples/plugin <span style="color: #CC9393;">\</span>
    ./octaspire-dern-repl -c
</pre>
</div>

<p>
Write into the REPL:
</p>

<div class="org-src-container">
<pre class="src src-octaspire-dern"><span style="color: #ff8c00;">(</span><span style="color: #DCDCCC; font-weight: bold;">require</span> 'mylib<span style="color: #ff8c00;">)</span>
<span style="color: #ff8c00;">(</span>mylib-say <span style="color: #CC9393;">[Hello world from library]</span><span style="color: #ff8c00;">)</span>
</pre>
</div>
</div>
</div>

<div id="outline-container-org738ab1b" class="outline-3">
<h3 id="org738ab1b"><span class="section-number-3">23.2</span> Building and using a binary library in MINIX 3</h3>
<div class="outline-text-3" id="text-23-2">
<p>
Run these commands from the <b>build</b>-directory of the source distribution:
</p>

<div class="org-src-container">
<pre class="src src-sh">make -C ../doc/examples/plugin -f Makefile.MINIX3
<span style="color: #DFAF8F;">LD_LIBRARY_PATH</span>=../doc/examples/plugin <span style="color: #CC9393;">\</span>
    ./octaspire-dern-repl -c
</pre>
</div>

<p>
Write into the REPL:
</p>

<div class="org-src-container">
<pre class="src src-octaspire-dern"><span style="color: #ff8c00;">(</span><span style="color: #DCDCCC; font-weight: bold;">require</span> 'mylib<span style="color: #ff8c00;">)</span>
<span style="color: #ff8c00;">(</span>mylib-say <span style="color: #CC9393;">[Hello world from library]</span><span style="color: #ff8c00;">)</span>
</pre>
</div>
</div>
</div>

<div id="outline-container-org2932337" class="outline-3">
<h3 id="org2932337"><span class="section-number-3">23.3</span> Building and using a binary library in Linux</h3>
<div class="outline-text-3" id="text-23-3">
<p>
Run these commands from the <b>build</b>-directory of the source distribution:
</p>

<div class="org-src-container">
<pre class="src src-sh">make -C ../doc/examples/plugin
<span style="color: #DFAF8F;">LD_LIBRARY_PATH</span>=../doc/examples/plugin <span style="color: #CC9393;">\</span>
    ./octaspire-dern-repl -c
</pre>
</div>

<p>
Write into the REPL:
</p>

<div class="org-src-container">
<pre class="src src-octaspire-dern"><span style="color: #ff8c00;">(</span><span style="color: #DCDCCC; font-weight: bold;">require</span> 'mylib<span style="color: #ff8c00;">)</span>
<span style="color: #ff8c00;">(</span>mylib-say <span style="color: #CC9393;">[Hello world from library]</span><span style="color: #ff8c00;">)</span>
</pre>
</div>
</div>
</div>

<div id="outline-container-org421fd11" class="outline-3">
<h3 id="org421fd11"><span class="section-number-3">23.4</span> Building and using a binary library in FreeBSD</h3>
<div class="outline-text-3" id="text-23-4">
<p>
Run these commands from the <b>build</b>-directory of the source distribution:
</p>

<div class="org-src-container">
<pre class="src src-sh">make -C ../doc/examples/plugin -f Makefile.FreeBSD
<span style="color: #DFAF8F;">LD_LIBRARY_PATH</span>=../doc/examples/plugin <span style="color: #CC9393;">\</span>
    ./octaspire-dern-repl -c
</pre>
</div>

<p>
Write into the REPL:
</p>

<div class="org-src-container">
<pre class="src src-octaspire-dern"><span style="color: #ff8c00;">(</span><span style="color: #DCDCCC; font-weight: bold;">require</span> 'mylib<span style="color: #ff8c00;">)</span>
<span style="color: #ff8c00;">(</span>mylib-say <span style="color: #CC9393;">[Hello world from library]</span><span style="color: #ff8c00;">)</span>
</pre>
</div>
</div>
</div>
