dev/doc/book/dern-manual.org
*** Building and using a binary library in NetBSD

Run these commands from the *build*-directory of the source distribution:

#+BEGIN_SRC sh
make -C ../doc/examples/plugin
LD_LIBRARY_PATH=../doc/examples/plugin \
    ./octaspire-dern-repl -c
#+END_SRC

Write into the REPL:

#+BEGIN_SRC octaspire-dern
(require 'mylib)
(mylib-say [Hello world from library])
#+END_SRC

** Using custom library loader with =require=

Sometimes you might want to override the default library searching and loading
functionality and use a custom loader instead. For example, when writing a game
that contains all the resources in a compressed archive or inside the executable
program, or maybe the library must be first downloaded through a socket.


#+BEGIN_SRC c
// ...

octaspire_input_t *my_custom_loader(
    char const * const name,
    octaspire_memory_allocator_t * const allocator)
{
    if (strcmp("test1.dern", name) == 0)
    {
        return octaspire_input_new_from_c_string(
            "(define f1 as (fn (a b) (+ a b)) [f1] "
            "'(a [a] b [b]) howto-ok)",
            allocator);
    }
    else if (strcmp("test2.dern", name) == 0)
    {
        return octaspire_input_new_from_c_string(
            "(define f2 as (fn (a b) (* a b)) [f2] "
            "'(a [a] b [b]) howto-ok)",
            allocator);
    }

    return 0;
}

int main(void)
{
    octaspire_dern_vm_config_t config =
        octaspire_dern_vm_config_default();
    config.preLoaderForRequireSrc = my_custom_loader;

    octaspire_dern_vm_t *vm =
        octaspire_dern_vm_new_with_config(
            myAllocator,
            myStdio,
            config);


    // In Dern:
    // (require 'test1)
    // (require 'test2)
    // ...
}
#+END_SRC

** Embedding in C programs

TODO

** Tool support

*etc*-directory of the source distribution contains syntax files for *vim*, *emacs*,
*pygments* and *GNU source-highlight*.

** Using the development repository
The amalgamated source release can be used without Make or other build tools;
only a compiler is needed. It is the recommended way of using Dern and is
available from the *release* directory of the git repository and from the
*dern.tar.bz2* archives at octaspire.io and octaspire.com. However, when
there is a need to modify Dern itself or to build the documentation, then
some tools are needed and the Makefile in the git repository should be used.
In this case the files to be modified are found from the *dev* directory.

On different systems the required installation commands can vary. In any case, you should install
a *C compiler* and *git*. Depending on the system, you might also need to install *GNU make*.
If you want to build the documentation, you should also install *Emacs 26.1* or newer.
For code coverage and performance measurement you might need to install additional tools.

That's it; *octaspire_core* and *octaspire_dotfiles* are included as
git submodules. The Emacs dotfiles are used to set the correct settings
and styling when building the documentation
(documentation is written using Emacs Org mode).

Example of using the development repository and the different targets available
in the Makefile:

#+BEGIN_SRC sh
git clone https://github.com/octaspire/dern.git
cd dern
make submodules-init
make
make test
make codestyle
make cppcheck
make valgrind
make coverage
make coverage-show
make perf-linux

./octaspire-dern-repl

make amalgamation
release/octaspire-dern-repl

make clean

rm release/octaspire-dern-amalgamated.c
make release/octaspire-dern-amalgamated.c

rm release/documentation/dern-manual.html
make release/documentation/dern-manual.html
#+END_SRC

Running =make= should run =make submodules-init= automatically if needed
(=make submodules-init= clones and initializes submodules), but it can be
run also manually when cloning the repository for the first time. There is
no need to run it again later.

If you want to update the submodules into the latest commits, you can
run =make submodules-pull=. It does a git pull on all the submodules.

Running =make= builds the Dern REPL and unit test runner from the separate
Dern source files and then the binary plugins using the amalgamation.

Running =make amalgamation= generates first the amalgamation (only, if the source files
are changed). Then it detects the system and runs the correct build script.
This creates the Dern REPL and unit test runner binaries and also the binary
plugins on some systems.

=make test= runs the unit tests, =make codestyle= runs the C coding style
checks, =make cppcheck= runs the cppcheck static analysis on the code,
=make valgrind= runs the unit tests through Valgrind (dynamic analysis
and memory leak detection) and =make coverage= generates a unit test
coverage report that can be used for finding code that is not covered
yet by unit tests. =make coverage-show= generates and shows the coverage
report in a web browser. =make perf-linux= measures the performance in GNU/Linux
using the unit test runner. =make release/documentation/dern-manual.html=
builds the documentation.

*** Raspberry Pi, Debian and Ubuntu

To build Dern from the regular source distribution in Raspberry Pi (Raspbian), Debian or Ubuntu (16.04 LTS) system:

#+BEGIN_SRC sh
sudo apt-get install git
git clone https://github.com/octaspire/dern.git
cd dern
make submodules-init
make
#+END_SRC

