release/documentation/dern-manual.html

<div id="outline-container-orgf5a02e7" class="outline-3">
<h3 id="orgf5a02e7"><span class="section-number-3">23.5</span> Building and using a binary library in NetBSD</h3>
<div class="outline-text-3" id="text-23-5">
<p>
Run these commands from the <b>build</b>-directory of the source distribution:
</p>

<div class="org-src-container">
<pre class="src src-sh">make -C ../doc/examples/plugin
<span style="color: #DFAF8F;">LD_LIBRARY_PATH</span>=../doc/examples/plugin <span style="color: #CC9393;">\</span>
    ./octaspire-dern-repl -c
</pre>
</div>

<p>
Write into the REPL:
</p>

<div class="org-src-container">
<pre class="src src-octaspire-dern"><span style="color: #ff8c00;">(</span><span style="color: #DCDCCC; font-weight: bold;">require</span> 'mylib<span style="color: #ff8c00;">)</span>
<span style="color: #ff8c00;">(</span>mylib-say <span style="color: #CC9393;">[Hello world from library]</span><span style="color: #ff8c00;">)</span>
</pre>
</div>
</div>
</div>
</div>

<div id="outline-container-org9f944cf" class="outline-2">
<h2 id="org9f944cf"><span class="section-number-2">24</span> Using custom library loader with <code>require</code></h2>
<div class="outline-text-2" id="text-24">
<p>
Sometimes you might want to override the default library searching and loading
functionality and use a custom loader instead. For example, when writing a game
that contains all the resources in a compressed archive or inside the executable
program, or maybe the library must be first downloaded through a socket.
</p>


<div class="org-src-container">
<pre class="src src-c"><span style="color: #5F7F5F;">// </span><span style="color: #7F9F7F;">...</span>

<span style="color: #7CB8BB;">octaspire_input_t</span> *<span style="color: #93E0E3;">my_custom_loader</span><span style="color: #ff8c00;">(</span>
    <span style="color: #7CB8BB;">char</span> <span style="color: #F0DFAF; font-weight: bold;">const</span> * <span style="color: #F0DFAF; font-weight: bold;">const</span> <span style="color: #DFAF8F;">name</span>,
    <span style="color: #7CB8BB;">octaspire_memory_allocator_t</span> * <span style="color: #F0DFAF; font-weight: bold;">const</span> <span style="color: #DFAF8F;">allocator</span><span style="color: #ff8c00;">)</span>
<span style="color: #ff8c00;">{</span>
    <span style="color: #F0DFAF; font-weight: bold;">if</span> <span style="color: #ff1493;">(</span>strcmp<span style="color: #7fff00;">(</span><span style="color: #CC9393;">"test1.dern"</span>, name<span style="color: #7fff00;">)</span> == 0<span style="color: #ff1493;">)</span>
    <span style="color: #ff1493;">{</span>
        <span style="color: #F0DFAF; font-weight: bold;">return</span> octaspire_input_new_from_c_string<span style="color: #7fff00;">(</span>
            <span style="color: #CC9393;">"(define f1 as (fn (a b) (+ a b)) [f1] "</span>
            <span style="color: #CC9393;">"'(a [a] b [b]) howto-ok)"</span>,
            allocator<span style="color: #7fff00;">)</span>;
    <span style="color: #ff1493;">}</span>
    <span style="color: #F0DFAF; font-weight: bold;">else</span> <span style="color: #F0DFAF; font-weight: bold;">if</span> <span style="color: #ff1493;">(</span>strcmp<span style="color: #7fff00;">(</span><span style="color: #CC9393;">"test2.dern"</span>, name<span style="color: #7fff00;">)</span> == 0<span style="color: #ff1493;">)</span>
    <span style="color: #ff1493;">{</span>
        <span style="color: #F0DFAF; font-weight: bold;">return</span> octaspire_input_new_from_c_string<span style="color: #7fff00;">(</span>
            <span style="color: #CC9393;">"(define f2 as (fn (a b) (* a b)) [f2] "</span>
            <span style="color: #CC9393;">"'(a [a] b [b]) howto-ok)"</span>,
            allocator<span style="color: #7fff00;">)</span>;
    <span style="color: #ff1493;">}</span>

    <span style="color: #F0DFAF; font-weight: bold;">return</span> 0;
<span style="color: #ff8c00;">}</span>

<span style="color: #7CB8BB;">int</span> <span style="color: #93E0E3;">main</span><span style="color: #ff8c00;">(</span><span style="color: #7CB8BB;">void</span><span style="color: #ff8c00;">)</span>
<span style="color: #ff8c00;">{</span>
    <span style="color: #7CB8BB;">octaspire_dern_vm_config_t</span> <span style="color: #DFAF8F;">config</span> =
        octaspire_dern_vm_config_default<span style="color: #ff1493;">()</span>;
    config.preLoaderForRequireSrc = my_custom_loader;

    <span style="color: #7CB8BB;">octaspire_dern_vm_t</span> *<span style="color: #DFAF8F;">vm</span> =
        octaspire_dern_vm_new_with_config<span style="color: #ff1493;">(</span>
            myAllocator,
            myStdio,
            config<span style="color: #ff1493;">)</span>;


    <span style="color: #5F7F5F;">// </span><span style="color: #7F9F7F;">In Dern:</span>
    <span style="color: #5F7F5F;">// </span><span style="color: #7F9F7F;">(require 'test1)</span>
    <span style="color: #5F7F5F;">// </span><span style="color: #7F9F7F;">(require 'test2)</span>
    <span style="color: #5F7F5F;">// </span><span style="color: #7F9F7F;">...</span>
<span style="color: #ff8c00;">}</span>
</pre>
</div>
</div>
</div>

<div id="outline-container-orgcab30a2" class="outline-2">
<h2 id="orgcab30a2"><span class="section-number-2">25</span> Embedding in C programs</h2>
<div class="outline-text-2" id="text-25">
<p>
TODO
</p>
</div>
</div>

<div id="outline-container-orgb958fcd" class="outline-2">
<h2 id="orgb958fcd"><span class="section-number-2">26</span> Tool support</h2>
<div class="outline-text-2" id="text-26">
<p>
<b>etc</b>-directory of the source distribution contains syntax files for <b>vim</b>, <b>emacs</b>,
<b>pygments</b> and <b>GNU source-highlight</b>.
</p>
</div>
</div>

<div id="outline-container-org09c6484" class="outline-2">
<h2 id="org09c6484"><span class="section-number-2">27</span> Using the development repository</h2>
<div class="outline-text-2" id="text-27">
<p>
The amalgamated source release can be used without Make or other build tools;
only a compiler is needed. It is the recommended way of using Dern and is
available from the <b>release</b> directory of the git repository and from the
<b>dern.tar.bz2</b> archives at octaspire.io and octaspire.com. However, when
there is a need to modify Dern itself or to build the documentation, then
some tools are needed and the Makefile in the git repository should be used.
In this case the files to be modified are found from the <b>dev</b> directory.
</p>

<p>
On different systems the required installation commands can vary. In any case, you should install
a <b>C compiler</b> and <b>git</b>. Depending on the system, you might also need to install <b>GNU make</b>.
If you want to build the documentation, you should also install <b>Emacs 26.1</b> or newer.
For code coverage and performance measurement you might need to install additional tools.
</p>

<p>
That&rsquo;s it; <b>octaspire<sub>core</sub></b> and <b>octaspire<sub>dotfiles</sub></b> are included as
git submodules. The Emacs dotfiles are used to set the correct settings
and styling when building the documentation
(documentation is written using Emacs Org mode).
</p>

<p>
Example of using the development repository and the different targets available
in the Makefile:
</p>

<div class="org-src-container">
<pre class="src src-sh">git clone https://github.com/octaspire/dern.git
<span style="color: #DCDCCC; font-weight: bold;">cd</span> dern
make submodules-init
make
make test
make codestyle
make cppcheck
make valgrind
make coverage
make coverage-show
make perf-linux

./octaspire-dern-repl

make amalgamation
release/octaspire-dern-repl

make clean

rm release/octaspire-dern-amalgamated.c
make release/octaspire-dern-amalgamated.c

rm release/documentation/dern-manual.html
make release/documentation/dern-manual.html
</pre>
</div>

<p>
Running <code>make</code> should run <code>make submodules-init</code> automatically if needed
(<code>make submodules-init</code> clones and initializes submodules), but it can be
run also manually when cloning the repository for the first time. There is
no need to run it again later.
</p>

<p>
If you want to update the submodules into the latest commits, you can
run <code>make submodules-pull</code>. It does a git pull on all the submodules.
</p>

<p>
Running <code>make</code> builds the Dern REPL and unit test runner from the separate
Dern source files and then the binary plugins using the amalgamation.
</p>

<p>
Running <code>make amalgamation</code> generates first the amalgamation (only, if the source files
are changed). Then it detects the system and runs the correct build script.
This creates the Dern REPL and unit test runner binaries and also the binary
plugins on some systems.
</p>

<p>
<code>make test</code> runs the unit tests, <code>make codestyle</code> runs the C coding style
checks, <code>make cppcheck</code> runs the cppcheck static analysis on the code,
<code>make valgrind</code> runs the unit tests through Valgrind (dynamic analysis
and memory leak detection) and <code>make coverage</code> generates a unit test
coverage report that can be used for finding code that is not covered
yet by unit tests. <code>make coverage-show</code> generates and shows the coverage
report in a web browser. <code>make perf-linux</code> measures the performance in GNU/Linux
using the unit test runner. <code>make release/documentation/dern-manual.html</code>
builds the documentation.
</p>
</div>

<div id="outline-container-orgf2ebe6a" class="outline-3">
<h3 id="orgf2ebe6a"><span class="section-number-3">27.1</span> Raspberry Pi, Debian and Ubuntu</h3>
<div class="outline-text-3" id="text-27-1">
<p>
To build Dern from the regular source distribution in Raspberry Pi (Raspbian), Debian or Ubuntu (16.04 LTS) system:
</p>

<div class="org-src-container">
<pre class="src src-sh">sudo apt-get install git
git clone https://github.com/octaspire/dern.git
<span style="color: #DCDCCC; font-weight: bold;">cd</span> dern
make submodules-init
make
</pre>
</div>
</div>
</div>
