dev/doc/book/dern-manual.org
*** Arch Linux

To build on Arch Linux (Arch Linux ARM) system:

#+BEGIN_SRC sh
sudo pacman -S git gcc make
git clone https://github.com/octaspire/dern.git
cd dern
make submodules-init
make
#+END_SRC

*** Haiku

To build on Haiku (Version Walter (Revision hrev51127) x86_gcc2):

#+BEGIN_SRC sh
pkgman install gcc_x86
git clone https://github.com/octaspire/dern.git
cd dern
make submodules-init
CC=gcc-x86 make
#+END_SRC

*** FreeBSD

To build on FreeBSD (FreeBSD-11.0-RELEASE-arm-armv6-RPI2) system:

#+BEGIN_SRC sh
sudo pkg install git
git clone https://github.com/octaspire/dern.git
cd dern
make submodules-init
make
#+END_SRC

*** NetBSD

To build on NetBSD (NetBSD-7.1-i386) system:

#+BEGIN_SRC sh
sudo pkgin install git
git clone git://github.com/octaspire/dern
cd dern
perl -pi -e 's/https/git/' .gitmodules
make submodules-init
make
#+END_SRC

*** MINIX 3

To build from the regular source distribution on MINIX 3 (minix_R3.3.0-588a35b) system:

#+BEGIN_SRC sh
su root
pkgin install clang binutils git-base
exit
git clone git://github.com/octaspire/dern
cd dern
perl -pi -e 's/https/git/' .gitmodules
make submodules-init
make
#+END_SRC



[fn:1] https://en.wiktionary.org/wiki/dern
