release/documentation/dern-manual.html

<div id="outline-container-org8fb2827" class="outline-3">
<h3 id="org8fb2827"><span class="section-number-3">27.2</span> Arch Linux</h3>
<div class="outline-text-3" id="text-27-2">
<p>
To build on Arch Linux (Arch Linux ARM) system:
</p>

<div class="org-src-container">
<pre class="src src-sh">sudo pacman -S git gcc make
git clone https://github.com/octaspire/dern.git
<span style="color: #DCDCCC; font-weight: bold;">cd</span> dern
make submodules-init
make
</pre>
</div>
</div>
</div>

<div id="outline-container-orgd6ce023" class="outline-3">
<h3 id="orgd6ce023"><span class="section-number-3">27.3</span> Haiku</h3>
<div class="outline-text-3" id="text-27-3">
<p>
To build on Haiku (Version Walter (Revision hrev51127) x86<sub>gcc2</sub>):
</p>

<div class="org-src-container">
<pre class="src src-sh">pkgman install gcc_x86
git clone https://github.com/octaspire/dern.git
<span style="color: #DCDCCC; font-weight: bold;">cd</span> dern
make submodules-init
<span style="color: #DFAF8F;">CC</span>=gcc-x86 make
</pre>
</div>
</div>
</div>

<div id="outline-container-orgdb2a47d" class="outline-3">
<h3 id="orgdb2a47d"><span class="section-number-3">27.4</span> FreeBSD</h3>
<div class="outline-text-3" id="text-27-4">
<p>
To build on FreeBSD (FreeBSD-11.0-RELEASE-arm-armv6-RPI2) system:
</p>

<div class="org-src-container">
<pre class="src src-sh">sudo pkg install git
git clone https://github.com/octaspire/dern.git
<span style="color: #DCDCCC; font-weight: bold;">cd</span> dern
make submodules-init
make
</pre>
</div>
</div>
</div>

<div id="outline-container-orgefed063" class="outline-3">
<h3 id="orgefed063"><span class="section-number-3">27.5</span> NetBSD</h3>
<div class="outline-text-3" id="text-27-5">
<p>
To build on NetBSD (NetBSD-7.1-i386) system:
</p>

<div class="org-src-container">
<pre class="src src-sh">sudo pkgin install git
git clone git://github.com/octaspire/dern
<span style="color: #DCDCCC; font-weight: bold;">cd</span> dern
perl -pi -e <span style="color: #CC9393;">'s/https/git/'</span> .gitmodules
make submodules-init
make
</pre>
</div>
</div>
</div>

<div id="outline-container-org34a4bfa" class="outline-3">
<h3 id="org34a4bfa"><span class="section-number-3">27.6</span> MINIX 3</h3>
<div class="outline-text-3" id="text-27-6">
<p>
To build from the regular source distribution on MINIX 3 (minix<sub>R3.3.0</sub>-588a35b) system:
</p>

<div class="org-src-container">
<pre class="src src-sh">su root
pkgin install clang binutils git-base
<span style="color: #F0DFAF; font-weight: bold;">exit</span>
git clone git://github.com/octaspire/dern
<span style="color: #DCDCCC; font-weight: bold;">cd</span> dern
perl -pi -e <span style="color: #CC9393;">'s/https/git/'</span> .gitmodules
make submodules-init
make
</pre>
</div>
</div>
</div>
</div>
<div id="footnotes">
<h2 class="footnotes">Footnotes: </h2>
<div id="text-footnotes">

<div class="footdef"><sup><a id="fn.1" class="footnum" href="#fnr.1">1</a></sup> <div class="footpara"><p class="footpara">
<a href="https://en.wiktionary.org/wiki/dern">https://en.wiktionary.org/wiki/dern</a>
</p></div></div>


</div>
</div></div>
<div id="postamble" class="status">
<p class="author">Author: www.octaspire.com</p>
<p class="date">Created: 2018-06-29 Fri 10:00</p>
<p class="validation"><a href="http://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>
